NETNABI-PJ/PBOT/PJ_DCB/DCB_STM32H723ZG/Code/Core/stm32h723xx_reg.h
typedef struct
{
    __IO uint32 ISR;              /*!< ADC Interrupt and Status Register,                          Address offset: 0x00 */
    __IO uint32 IER;              /*!< ADC Interrupt Enable Register,                              Address offset: 0x04 */
    __IO uint32 CR;               /*!< ADC control register,                                       Address offset: 0x08 */
    __IO uint32 CFGR;             /*!< ADC Configuration register,                                 Address offset: 0x0C */
    __IO uint32 CFGR2;            /*!< ADC Configuration register 2,                               Address offset: 0x10 */
    __IO uint32 SMPR1;            /*!< ADC sample time register 1,                                 Address offset: 0x14 */
    __IO uint32 SMPR2;            /*!< ADC sample time register 2,                                 Address offset: 0x18 */
    __IO uint32 PCSEL_RES0;       /*!< Reserved for ADC3, ADC1/2 pre-channel selection,             Address offset: 0x1C */
    __IO uint32 LTR1_TR1;         /*!< ADC watchdog Lower threshold register 1,                    Address offset: 0x20 */
    __IO uint32 HTR1_TR2;         /*!< ADC watchdog higher threshold register 1,                   Address offset: 0x24 */
    __IO uint32 RES1_TR3;         /*!< Reserved for ADC1/2, ADC3 threshold register,                Address offset: 0x28 */
    uint32      RESERVED2;        /*!< Reserved, 0x02C                                                                  */
    __IO uint32 SQR1;             /*!< ADC regular sequence register 1,                            Address offset: 0x30 */
    __IO uint32 SQR2;             /*!< ADC regular sequence register 2,                            Address offset: 0x34 */
    __IO uint32 SQR3;             /*!< ADC regular sequence register 3,                            Address offset: 0x38 */
    __IO uint32 SQR4;             /*!< ADC regular sequence register 4,                            Address offset: 0x3C */
    __IO uint32 DR;               /*!< ADC regular data register,                                  Address offset: 0x40 */
    uint32      RESERVED3;        /*!< Reserved, 0x044                                                                  */
    uint32      RESERVED4;        /*!< Reserved, 0x048                                                                  */
    __IO uint32 JSQR;             /*!< ADC injected sequence register,                             Address offset: 0x4C */
    uint32      RESERVED5[4];     /*!< Reserved, 0x050 - 0x05C                                                          */
    __IO uint32 OFR1;             /*!< ADC offset register 1,                                      Address offset: 0x60 */
    __IO uint32 OFR2;             /*!< ADC offset register 2,                                      Address offset: 0x64 */
    __IO uint32 OFR3;             /*!< ADC offset register 3,                                      Address offset: 0x68 */
    __IO uint32 OFR4;             /*!< ADC offset register 4,                                      Address offset: 0x6C */
    uint32      RESERVED6[4];     /*!< Reserved, 0x070 - 0x07C                                                          */
    __IO uint32 JDR1;             /*!< ADC injected data register 1,                               Address offset: 0x80 */
    __IO uint32 JDR2;             /*!< ADC injected data register 2,                               Address offset: 0x84 */
    __IO uint32 JDR3;             /*!< ADC injected data register 3,                               Address offset: 0x88 */
    __IO uint32 JDR4;             /*!< ADC injected data register 4,                               Address offset: 0x8C */
    uint32      RESERVED7[4];     /*!< Reserved, 0x090 - 0x09C                                                          */
    __IO uint32 AWD2CR;           /*!< ADC  Analog Watchdog 2 Configuration Register,              Address offset: 0xA0 */
    __IO uint32 AWD3CR;           /*!< ADC  Analog Watchdog 3 Configuration Register,              Address offset: 0xA4 */
    uint32      RESERVED8;        /*!< Reserved, 0x0A8                                                                  */
    uint32      RESERVED9;        /*!< Reserved, 0x0AC                                                                  */
    __IO uint32 LTR2_DIFSEL;      /*!< ADC watchdog Lower threshold register 2, Difsel for ADC3,   Address offset: 0xB0 */
    __IO uint32 HTR2_CALFACT;     /*!< ADC watchdog Higher threshold register 2, Calfact for ADC3, Address offset: 0xB4 */
    __IO uint32 LTR3_RES10;       /*!< ADC watchdog Lower threshold register 3, specific ADC1/2,   Address offset: 0xB8 */
    __IO uint32 HTR3_RES11;       /*!< ADC watchdog Higher threshold register 3, specific ADC1/2,  Address offset: 0xBC */
    __IO uint32 DIFSEL_RES12;     /*!< ADC Differential Mode Selection Register specific ADC1/2,   Address offset: 0xC0 */
    __IO uint32 CALFACT_RES13;    /*!< ADC Calibration Factors specific ADC1/2,                    Address offset: 0xC4 */
    __IO uint32 CALFACT2_RES14;   /*!< ADC Linearity Calibration Factors specific ADC1/2,          Address offset: 0xC8 */
} ADC_TypeDef;


typedef struct
{
    __IO uint32 CSR; /*!< ADC Common status register, Address offset: ADC1/3 base address + 0x300 */
    uint32 RESERVED; /*!< Reserved, ADC1/3 base address + 0x304 */
    __IO uint32 CCR; /*!< ADC common control register, Address offset: ADC1/3 base address + 0x308 */
    __IO uint32 CDR; /*!< ADC common regular data register for dual Address offset: ADC1/3 base address + 0x30C */
    __IO uint32 CDR2; /*!< ADC common regular data register for 32-bit dual mode Address offset: ADC1/3 base address + 0x310 */
} ADC_Common_TypeDef;

typedef struct
{
    __IO uint32 CSR;         /*!< VREFBUF control and status register,         Address offset: 0x00 */
    __IO uint32 CCR;         /*!< VREFBUF calibration and control register,    Address offset: 0x04 */
} VREFBUF_TypeDef;

typedef struct
{
    __IO uint32 CREL;         /*!< FDCAN Core Release register,                                     Address offset: 0x000 */
    __IO uint32 ENDN;         /*!< FDCAN Endian register,                                           Address offset: 0x004 */
    __IO uint32 RESERVED1;    /*!< Reserved,                                                                        0x008 */
    __IO uint32 DBTP;         /*!< FDCAN Data Bit Timing & Prescaler register,                      Address offset: 0x00C */
    __IO uint32 TEST;         /*!< FDCAN Test register,                                             Address offset: 0x010 */
    __IO uint32 RWD;          /*!< FDCAN RAM Watchdog register,                                     Address offset: 0x014 */
    __IO uint32 CCCR;         /*!< FDCAN CC Control register,                                       Address offset: 0x018 */
    __IO uint32 NBTP;         /*!< FDCAN Nominal Bit Timing & Prescaler register,                   Address offset: 0x01C */
    __IO uint32 TSCC;         /*!< FDCAN Timestamp Counter Configuration register,                  Address offset: 0x020 */
    __IO uint32 TSCV;         /*!< FDCAN Timestamp Counter Value register,                          Address offset: 0x024 */
    __IO uint32 TOCC;         /*!< FDCAN Timeout Counter Configuration register,                    Address offset: 0x028 */
    __IO uint32 TOCV;         /*!< FDCAN Timeout Counter Value register,                            Address offset: 0x02C */
    __IO uint32 RESERVED2[4]; /*!< Reserved,                                                                0x030 - 0x03C */
    __IO uint32 ECR;          /*!< FDCAN Error Counter register,                                    Address offset: 0x040 */
    __IO uint32 PSR;          /*!< FDCAN Protocol Status register,                                  Address offset: 0x044 */
    __IO uint32 TDCR;         /*!< FDCAN Transmitter Delay Compensation register,                   Address offset: 0x048 */
    __IO uint32 RESERVED3;    /*!< Reserved,                                                                        0x04C */
    __IO uint32 IR;           /*!< FDCAN Interrupt register,                                        Address offset: 0x050 */
    __IO uint32 IE;           /*!< FDCAN Interrupt Enable register,                                 Address offset: 0x054 */
    __IO uint32 ILS;          /*!< FDCAN Interrupt Line Select register,                            Address offset: 0x058 */
    __IO uint32 ILE;          /*!< FDCAN Interrupt Line Enable register,                            Address offset: 0x05C */
    __IO uint32 RESERVED4[8]; /*!< Reserved,                                                                0x060 - 0x07C */
    __IO uint32 GFC;          /*!< FDCAN Global Filter Configuration register,                      Address offset: 0x080 */
    __IO uint32 SIDFC;        /*!< FDCAN Standard ID Filter Configuration register,                 Address offset: 0x084 */
    __IO uint32 XIDFC;        /*!< FDCAN Extended ID Filter Configuration register,                 Address offset: 0x088 */
    __IO uint32 RESERVED5;    /*!< Reserved,                                                                        0x08C */
    __IO uint32 XIDAM;        /*!< FDCAN Extended ID AND Mask register,                             Address offset: 0x090 */
    __IO uint32 HPMS;         /*!< FDCAN High Priority Message Status register,                     Address offset: 0x094 */
    __IO uint32 NDAT1;        /*!< FDCAN New Data 1 register,                                       Address offset: 0x098 */
    __IO uint32 NDAT2;        /*!< FDCAN New Data 2 register,                                       Address offset: 0x09C */
    __IO uint32 RXF0C;        /*!< FDCAN Rx FIFO 0 Configuration register,                          Address offset: 0x0A0 */
    __IO uint32 RXF0S;        /*!< FDCAN Rx FIFO 0 Status register,                                 Address offset: 0x0A4 */
    __IO uint32 RXF0A;        /*!< FDCAN Rx FIFO 0 Acknowledge register,                            Address offset: 0x0A8 */
    __IO uint32 RXBC;         /*!< FDCAN Rx Buffer Configuration register,                          Address offset: 0x0AC */
    __IO uint32 RXF1C;        /*!< FDCAN Rx FIFO 1 Configuration register,                          Address offset: 0x0B0 */
    __IO uint32 RXF1S;        /*!< FDCAN Rx FIFO 1 Status register,                                 Address offset: 0x0B4 */
    __IO uint32 RXF1A;        /*!< FDCAN Rx FIFO 1 Acknowledge register,                            Address offset: 0x0B8 */
    __IO uint32 RXESC;        /*!< FDCAN Rx Buffer/FIFO Element Size Configuration register,        Address offset: 0x0BC */
    __IO uint32 TXBC;         /*!< FDCAN Tx Buffer Configuration register,                          Address offset: 0x0C0 */
    __IO uint32 TXFQS;        /*!< FDCAN Tx FIFO/Queue Status register,                             Address offset: 0x0C4 */
    __IO uint32 TXESC;        /*!< FDCAN Tx Buffer Element Size Configuration register,             Address offset: 0x0C8 */
    __IO uint32 TXBRP;        /*!< FDCAN Tx Buffer Request Pending register,                        Address offset: 0x0CC */
    __IO uint32 TXBAR;        /*!< FDCAN Tx Buffer Add Request register,                            Address offset: 0x0D0 */
    __IO uint32 TXBCR;        /*!< FDCAN Tx Buffer Cancellation Request register,                   Address offset: 0x0D4 */
    __IO uint32 TXBTO;        /*!< FDCAN Tx Buffer Transmission Occurred register,                  Address offset: 0x0D8 */
    __IO uint32 TXBCF;        /*!< FDCAN Tx Buffer Cancellation Finished register,                  Address offset: 0x0DC */
    __IO uint32 TXBTIE;       /*!< FDCAN Tx Buffer Transmission Interrupt Enable register,          Address offset: 0x0E0 */
    __IO uint32 TXBCIE;       /*!< FDCAN Tx Buffer Cancellation Finished Interrupt Enable register, Address offset: 0x0E4 */
    __IO uint32 RESERVED6[2]; /*!< Reserved,                                                                0x0E8 - 0x0EC */
    __IO uint32 TXEFC;        /*!< FDCAN Tx Event FIFO Configuration register,                      Address offset: 0x0F0 */
    __IO uint32 TXEFS;        /*!< FDCAN Tx Event FIFO Status register,                             Address offset: 0x0F4 */
    __IO uint32 TXEFA;        /*!< FDCAN Tx Event FIFO Acknowledge register,                        Address offset: 0x0F8 */
    __IO uint32 RESERVED7;    /*!< Reserved,                                                                        0x0FC */
} FDCAN_GlobalTypeDef;

typedef struct
{
    __IO uint32 TTTMC;          /*!< TT Trigger Memory Configuration register,    Address offset: 0x100 */
    __IO uint32 TTRMC;          /*!< TT Reference Message Configuration register, Address offset: 0x104 */
    __IO uint32 TTOCF;          /*!< TT Operation Configuration register,         Address offset: 0x108 */
    __IO uint32 TTMLM;          /*!< TT Matrix Limits register,                   Address offset: 0x10C */
    __IO uint32 TURCF;          /*!< TUR Configuration register,                  Address offset: 0x110 */
    __IO uint32 TTOCN;          /*!< TT Operation Control register,               Address offset: 0x114 */
    __IO uint32 TTGTP;          /*!< TT Global Time Preset register,              Address offset: 0x118 */
    __IO uint32 TTTMK;          /*!< TT Time Mark register,                       Address offset: 0x11C */
    __IO uint32 TTIR;           /*!< TT Interrupt register,                       Address offset: 0x120 */
    __IO uint32 TTIE;           /*!< TT Interrupt Enable register,                Address offset: 0x124 */
    __IO uint32 TTILS;          /*!< TT Interrupt Line Select register,           Address offset: 0x128 */
    __IO uint32 TTOST;          /*!< TT Operation Status register,                Address offset: 0x12C */
    __IO uint32 TURNA;          /*!< TT TUR Numerator Actual register,            Address offset: 0x130 */
    __IO uint32 TTLGT;          /*!< TT Local and Global Time register,           Address offset: 0x134 */
    __IO uint32 TTCTC;          /*!< TT Cycle Time and Count register,            Address offset: 0x138 */
    __IO uint32 TTCPT;          /*!< TT Capture Time register,                    Address offset: 0x13C */
    __IO uint32 TTCSM;          /*!< TT Cycle Sync Mark register,                 Address offset: 0x140 */
    __IO uint32 RESERVED1[111]; /*!< Reserved,                                            0x144 - 0x2FC */
    __IO uint32 TTTS;           /*!< TT Trigger Select register,                  Address offset: 0x300 */
} TTCAN_TypeDef;

typedef struct
{
    __IO uint32 CREL;  /*!< Clock Calibration Unit Core Release register, Address offset: 0x00 */
    __IO uint32 CCFG;  /*!< Calibration Configuration register,           Address offset: 0x04 */
    __IO uint32 CSTAT; /*!< Calibration Status register,                  Address offset: 0x08 */
    __IO uint32 CWD;   /*!< Calibration Watchdog register,                Address offset: 0x0C */
    __IO uint32 IR;    /*!< CCU Interrupt register,                       Address offset: 0x10 */
    __IO uint32 IE;    /*!< CCU Interrupt Enable register,                Address offset: 0x14 */
} FDCAN_ClockCalibrationUnit_TypeDef;

typedef struct
{
    __IO uint32 CR;           /*!< CEC control register,              Address offset:0x00 */
    __IO uint32 CFGR;         /*!< CEC configuration register,        Address offset:0x04 */
    __IO uint32 TXDR;         /*!< CEC Tx data register ,             Address offset:0x08 */
    __IO uint32 RXDR;         /*!< CEC Rx Data Register,              Address offset:0x0C */
    __IO uint32 ISR;          /*!< CEC Interrupt and Status Register, Address offset:0x10 */
    __IO uint32 IER;          /*!< CEC interrupt enable register,     Address offset:0x14 */
}CEC_TypeDef;

typedef struct
{
    __IO uint32 CSR;          /*!< CORDIC control and status register,        Address offset: 0x00 */
    __IO uint32 WDATA;        /*!< CORDIC argument register,                  Address offset: 0x04 */
    __IO uint32 RDATA;        /*!< CORDIC result register,                    Address offset: 0x08 */
} CORDIC_TypeDef;

typedef struct
{
    __IO uint32 DR;          /*!< CRC Data register,                           Address offset: 0x00 */
    __IO uint32 IDR;         /*!< CRC Independent data register,               Address offset: 0x04 */
    __IO uint32 CR;          /*!< CRC Control register,                        Address offset: 0x08 */
    uint32      RESERVED2;   /*!< Reserved,                                                    0x0C */
    __IO uint32 INIT;        /*!< Initial CRC value register,                  Address offset: 0x10 */
    __IO uint32 POL;         /*!< CRC polynomial register,                     Address offset: 0x14 */
} CRC_TypeDef;


typedef struct
{
    __IO uint32 CR;            /*!< CRS ccontrol register,              Address offset: 0x00 */
    __IO uint32 CFGR;          /*!< CRS configuration register,         Address offset: 0x04 */
    __IO uint32 ISR;           /*!< CRS interrupt and status register,  Address offset: 0x08 */
    __IO uint32 ICR;           /*!< CRS interrupt flag clear register,  Address offset: 0x0C */
} CRS_TypeDef;

typedef struct
{
    __IO uint32 CR;       /*!< DAC control register,                                    Address offset: 0x00 */
    __IO uint32 SWTRIGR;  /*!< DAC software trigger register,                           Address offset: 0x04 */
    __IO uint32 DHR12R1;  /*!< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08 */
    __IO uint32 DHR12L1;  /*!< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C */
    __IO uint32 DHR8R1;   /*!< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10 */
    __IO uint32 DHR12R2;  /*!< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14 */
    __IO uint32 DHR12L2;  /*!< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18 */
    __IO uint32 DHR8R2;   /*!< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C */
    __IO uint32 DHR12RD;  /*!< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20 */
    __IO uint32 DHR12LD;  /*!< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24 */
    __IO uint32 DHR8RD;   /*!< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28 */
    __IO uint32 DOR1;     /*!< DAC channel1 data output register,                       Address offset: 0x2C */
    __IO uint32 DOR2;     /*!< DAC channel2 data output register,                       Address offset: 0x30 */
    __IO uint32 SR;       /*!< DAC status register,                                     Address offset: 0x34 */
    __IO uint32 CCR;      /*!< DAC calibration control register,                        Address offset: 0x38 */
    __IO uint32 MCR;      /*!< DAC mode control register,                               Address offset: 0x3C */
    __IO uint32 SHSR1;    /*!< DAC Sample and Hold sample time register 1,              Address offset: 0x40 */
    __IO uint32 SHSR2;    /*!< DAC Sample and Hold sample time register 2,              Address offset: 0x44 */
    __IO uint32 SHHR;     /*!< DAC Sample and Hold hold time register,                  Address offset: 0x48 */
    __IO uint32 SHRR;     /*!< DAC Sample and Hold refresh time register,               Address offset: 0x4C */
} DAC_TypeDef;

typedef struct
{
    __IO uint32 FLTCR1;          /*!< DFSDM control register1,                          Address offset: 0x100 */
    __IO uint32 FLTCR2;          /*!< DFSDM control register2,                          Address offset: 0x104 */
    __IO uint32 FLTISR;          /*!< DFSDM interrupt and status register,              Address offset: 0x108 */
    __IO uint32 FLTICR;          /*!< DFSDM interrupt flag clear register,              Address offset: 0x10C */
    __IO uint32 FLTJCHGR;        /*!< DFSDM injected channel group selection register,  Address offset: 0x110 */
    __IO uint32 FLTFCR;          /*!< DFSDM filter control register,                    Address offset: 0x114 */
    __IO uint32 FLTJDATAR;       /*!< DFSDM data register for injected group,           Address offset: 0x118 */
    __IO uint32 FLTRDATAR;       /*!< DFSDM data register for regular group,            Address offset: 0x11C */
    __IO uint32 FLTAWHTR;        /*!< DFSDM analog watchdog high threshold register,    Address offset: 0x120 */
    __IO uint32 FLTAWLTR;        /*!< DFSDM analog watchdog low threshold register,     Address offset: 0x124 */
    __IO uint32 FLTAWSR;         /*!< DFSDM analog watchdog status register             Address offset: 0x128 */
    __IO uint32 FLTAWCFR;        /*!< DFSDM analog watchdog clear flag register         Address offset: 0x12C */
    __IO uint32 FLTEXMAX;        /*!< DFSDM extreme detector maximum register,          Address offset: 0x130 */
    __IO uint32 FLTEXMIN;        /*!< DFSDM extreme detector minimum register           Address offset: 0x134 */
    __IO uint32 FLTCNVTIMR;      /*!< DFSDM conversion timer,                           Address offset: 0x138 */
} DFSDM_Filter_TypeDef;


typedef struct
{
    __IO uint32 CHCFGR1;      /*!< DFSDM channel configuration register1,            Address offset: 0x00 */
    __IO uint32 CHCFGR2;      /*!< DFSDM channel configuration register2,            Address offset: 0x04 */
    __IO uint32 CHAWSCDR;     /*!< DFSDM channel analog watchdog and
                                    short circuit detector register,                  Address offset: 0x08 */
    __IO uint32 CHWDATAR;     /*!< DFSDM channel watchdog filter data register,      Address offset: 0x0C */
    __IO uint32 CHDATINR;     /*!< DFSDM channel data input register,                Address offset: 0x10 */
} DFSDM_Channel_TypeDef;

