NETNABI-PJ/PBOT/PJ_DCB/DCB_STM32H723ZG/Code/Core/stm32h723xx_reg.h
typedef struct
{
    __IO uint32 IDCODE;        /*!< MCU device ID code,                     Address offset: 0x00 */
    __IO uint32 CR;            /*!< Debug MCU configuration register,       Address offset: 0x04 */
    uint32 RESERVED4[11];      /*!< Reserved,                             Address offset: 0x08 */
    __IO uint32 APB3FZ1;     /*!< Debug MCU APB3FZ1 freeze register,    Address offset: 0x34 */
    uint32 RESERVED5;          /*!< Reserved,                             Address offset: 0x38 */
    __IO uint32 APB1LFZ1;    /*!< Debug MCU APB1LFZ1 freeze register,   Address offset: 0x3C */
    uint32 RESERVED6;          /*!< Reserved,                             Address offset: 0x40 */
    __IO uint32 APB1HFZ1;    /*!< Debug MCU APB1LFZ1 freeze register,   Address offset: 0x44 */
    uint32 RESERVED7;          /*!< Reserved,                             Address offset: 0x48 */
    __IO uint32 APB2FZ1;     /*!< Debug MCU APB2FZ1 freeze register,    Address offset: 0x4C */
    uint32 RESERVED8;          /*!< Reserved,                             Address offset: 0x50 */
    __IO uint32 APB4FZ1;     /*!< Debug MCU APB4FZ1 freeze register,    Address offset: 0x54 */
    __IO uint32 RESERVED9[990]; /*!< Reserved,                         Address offset: 0x58-0xFCC */
    __IO uint32 PIDR4;       /*!< Debug MCU peripheral identity register 4,  Address offset: 0xFD0 */
    __IO uint32 RESERVED10[3];/*!< Reserved,                            Address offset: 0xFD4-0xFDC */
    __IO uint32 PIDR0;       /*!< Debug MCU peripheral identity register 0,  Address offset: 0xFE0 */
    __IO uint32 PIDR1;       /*!< Debug MCU peripheral identity register 1,  Address offset: 0xFE4 */
    __IO uint32 PIDR2;       /*!< Debug MCU peripheral identity register 2,  Address offset: 0xFE8 */
    __IO uint32 PIDR3;       /*!< Debug MCU peripheral identity register 3,  Address offset: 0xFEC */
    __IO uint32 CIDR0;       /*!< Debug MCU component identity register 0,   Address offset: 0xFF0 */
    __IO uint32 CIDR1;       /*!< Debug MCU component identity register 1,   Address offset: 0xFF4 */
    __IO uint32 CIDR2;       /*!< Debug MCU component identity register 2,   Address offset: 0xFF8 */
    __IO uint32 CIDR3;       /*!< Debug MCU component identity register 3,   Address offset: 0xFFC */
}DBGMCU_TypeDef;

typedef struct
{
    __IO uint32 CR;       /*!< DCMI control register 1,                       Address offset: 0x00 */
    __IO uint32 SR;       /*!< DCMI status register,                          Address offset: 0x04 */
    __IO uint32 RISR;     /*!< DCMI raw interrupt status register,            Address offset: 0x08 */
    __IO uint32 IER;      /*!< DCMI interrupt enable register,                Address offset: 0x0C */
    __IO uint32 MISR;     /*!< DCMI masked interrupt status register,         Address offset: 0x10 */
    __IO uint32 ICR;      /*!< DCMI interrupt clear register,                 Address offset: 0x14 */
    __IO uint32 ESCR;     /*!< DCMI embedded synchronization code register,   Address offset: 0x18 */
    __IO uint32 ESUR;     /*!< DCMI embedded synchronization unmask register, Address offset: 0x1C */
    __IO uint32 CWSTRTR;  /*!< DCMI crop window start,                        Address offset: 0x20 */
    __IO uint32 CWSIZER;  /*!< DCMI crop window size,                         Address offset: 0x24 */
    __IO uint32 DR;       /*!< DCMI data register,                            Address offset: 0x28 */
} DCMI_TypeDef;

typedef struct
{
    __IO uint32 CR;             /*!< PSSI control register 1,               Address offset: 0x000 */
    __IO uint32 SR;             /*!< PSSI status register,                  Address offset: 0x004 */
    __IO uint32 RIS;            /*!< PSSI raw interrupt status register,    Address offset: 0x008 */
    __IO uint32 IER;            /*!< PSSI interrupt enable register,        Address offset: 0x00C */
    __IO uint32 MIS;            /*!< PSSI masked interrupt status register, Address offset: 0x010 */
    __IO uint32 ICR;            /*!< PSSI interrupt clear register,         Address offset: 0x014 */
    __IO uint32 RESERVED1[4];   /*!< Reserved,                                      0x018 - 0x024 */
    __IO uint32 DR;             /*!< PSSI data register,                    Address offset: 0x028 */
    __IO uint32 RESERVED2[241]; /*!< Reserved,                                      0x02C - 0x3EC */
    __IO uint32 HWCFGR;         /*!< PSSI IP HW configuration register,     Address offset: 0x3F0 */
    __IO uint32 VERR;           /*!< PSSI IP version register,              Address offset: 0x3F4 */
    __IO uint32 IPIDR;          /*!< PSSI IP ID register,                   Address offset: 0x3F8 */
    __IO uint32 SIDR;           /*!< PSSI SIZE ID register,                 Address offset: 0x3FC */
} PSSI_TypeDef;

typedef struct
{
    __IO uint32 CR;     /*!< DMA stream x configuration register      */
    __IO uint32 NDTR;   /*!< DMA stream x number of data register     */
    __IO uint32 PAR;    /*!< DMA stream x peripheral address register */
    __IO uint32 M0AR;   /*!< DMA stream x memory 0 address register   */
    __IO uint32 M1AR;   /*!< DMA stream x memory 1 address register   */
    __IO uint32 FCR;    /*!< DMA stream x FIFO control register       */
} DMA_Stream_TypeDef;

typedef struct
{
    __IO uint32 LISR;   /*!< DMA low interrupt status register,      Address offset: 0x00 */
    __IO uint32 HISR;   /*!< DMA high interrupt status register,     Address offset: 0x04 */
    __IO uint32 LIFCR;  /*!< DMA low interrupt flag clear register,  Address offset: 0x08 */
    __IO uint32 HIFCR;  /*!< DMA high interrupt flag clear register, Address offset: 0x0C */
} DMA_TypeDef;

typedef struct
{
    __IO uint32 CCR;          /*!< DMA channel x configuration register          */
    __IO uint32 CNDTR;        /*!< DMA channel x number of data register         */
    __IO uint32 CPAR;         /*!< DMA channel x peripheral address register     */
    __IO uint32 CM0AR;        /*!< DMA channel x memory 0 address register       */
    __IO uint32 CM1AR;        /*!< DMA channel x memory 1 address register       */
} BDMA_Channel_TypeDef;

typedef struct
{
    __IO uint32 ISR;          /*!< DMA interrupt status register,               Address offset: 0x00 */
    __IO uint32 IFCR;         /*!< DMA interrupt flag clear register,           Address offset: 0x04 */
} BDMA_TypeDef;

typedef struct
{
    __IO uint32  CCR;        /*!< DMA Multiplexer Channel x Control Register   */
}DMAMUX_Channel_TypeDef;

typedef struct
{
    __IO uint32  CSR;      /*!< DMA Channel Status Register     */
    __IO uint32  CFR;      /*!< DMA Channel Clear Flag Register */
}DMAMUX_ChannelStatus_TypeDef;

typedef struct
{
    __IO uint32  RGCR;        /*!< DMA Request Generator x Control Register   */
}DMAMUX_RequestGen_TypeDef;

typedef struct
{
    __IO uint32  RGSR;        /*!< DMA Request Generator Status Register       */
    __IO uint32  RGCFR;       /*!< DMA Request Generator Clear Flag Register   */
}DMAMUX_RequestGenStatus_TypeDef;


typedef struct
{
    __IO uint32  GISR0;   /*!< MDMA Global Interrupt/Status Register 0,          Address offset: 0x00 */
}MDMA_TypeDef;

typedef struct
{
    __IO uint32  CISR;      /*!< MDMA channel x interrupt/status register,             Address offset: 0x40 */
    __IO uint32  CIFCR;     /*!< MDMA channel x interrupt flag clear register,         Address offset: 0x44 */
    __IO uint32  CESR;      /*!< MDMA Channel x error status register,                 Address offset: 0x48 */
    __IO uint32  CCR;       /*!< MDMA channel x control register,                      Address offset: 0x4C */
    __IO uint32  CTCR;      /*!< MDMA channel x Transfer Configuration register,       Address offset: 0x50 */
    __IO uint32  CBNDTR;    /*!< MDMA Channel x block number of data register,         Address offset: 0x54 */
    __IO uint32  CSAR;      /*!< MDMA channel x source address register,               Address offset: 0x58 */
    __IO uint32  CDAR;      /*!< MDMA channel x destination address register,          Address offset: 0x5C */
    __IO uint32  CBRUR;     /*!< MDMA channel x Block Repeat address Update register,  Address offset: 0x60 */
    __IO uint32  CLAR;      /*!< MDMA channel x Link Address register,                 Address offset: 0x64 */
    __IO uint32  CTBR;      /*!< MDMA channel x Trigger and Bus selection Register,    Address offset: 0x68 */
    uint32       RESERVED0; /*!< Reserved, 0x6C                                                             */
    __IO uint32  CMAR;      /*!< MDMA channel x Mask address register,                 Address offset: 0x70 */
    __IO uint32  CMDR;      /*!< MDMA channel x Mask Data register,                    Address offset: 0x74 */
}MDMA_Channel_TypeDef;

typedef struct
{
    __IO uint32 CR;            /*!< DMA2D Control Register,                         Address offset: 0x00 */
    __IO uint32 ISR;           /*!< DMA2D Interrupt Status Register,                Address offset: 0x04 */
    __IO uint32 IFCR;          /*!< DMA2D Interrupt Flag Clear Register,            Address offset: 0x08 */
    __IO uint32 FGMAR;         /*!< DMA2D Foreground Memory Address Register,       Address offset: 0x0C */
    __IO uint32 FGOR;          /*!< DMA2D Foreground Offset Register,               Address offset: 0x10 */
    __IO uint32 BGMAR;         /*!< DMA2D Background Memory Address Register,       Address offset: 0x14 */
    __IO uint32 BGOR;          /*!< DMA2D Background Offset Register,               Address offset: 0x18 */
    __IO uint32 FGPFCCR;       /*!< DMA2D Foreground PFC Control Register,          Address offset: 0x1C */
    __IO uint32 FGCOLR;        /*!< DMA2D Foreground Color Register,                Address offset: 0x20 */
    __IO uint32 BGPFCCR;       /*!< DMA2D Background PFC Control Register,          Address offset: 0x24 */
    __IO uint32 BGCOLR;        /*!< DMA2D Background Color Register,                Address offset: 0x28 */
    __IO uint32 FGCMAR;        /*!< DMA2D Foreground CLUT Memory Address Register,  Address offset: 0x2C */
    __IO uint32 BGCMAR;        /*!< DMA2D Background CLUT Memory Address Register,  Address offset: 0x30 */
    __IO uint32 OPFCCR;        /*!< DMA2D Output PFC Control Register,              Address offset: 0x34 */
    __IO uint32 OCOLR;         /*!< DMA2D Output Color Register,                    Address offset: 0x38 */
    __IO uint32 OMAR;          /*!< DMA2D Output Memory Address Register,           Address offset: 0x3C */
    __IO uint32 OOR;           /*!< DMA2D Output Offset Register,                   Address offset: 0x40 */
    __IO uint32 NLR;           /*!< DMA2D Number of Line Register,                  Address offset: 0x44 */
    __IO uint32 LWR;           /*!< DMA2D Line Watermark Register,                  Address offset: 0x48 */
    __IO uint32 AMTCR;         /*!< DMA2D AHB Master Timer Configuration Register,  Address offset: 0x4C */
    uint32      RESERVED[236]; /*!< Reserved, 0x50-0x3FF */
    __IO uint32 FGCLUT[256];   /*!< DMA2D Foreground CLUT,                          Address offset:400-7FF */
    __IO uint32 BGCLUT[256];   /*!< DMA2D Background CLUT,                          Address offset:800-BFF */
} DMA2D_TypeDef;


typedef struct
{
    __IO uint32 MACCR;
    __IO uint32 MACECR;
    __IO uint32 MACPFR;
    __IO uint32 MACWTR;
    __IO uint32 MACHT0R;
    __IO uint32 MACHT1R;
    uint32      RESERVED1[14];
    __IO uint32 MACVTR;
    uint32      RESERVED2;
    __IO uint32 MACVHTR;
    uint32      RESERVED3;
    __IO uint32 MACVIR;
    __IO uint32 MACIVIR;
    uint32      RESERVED4[2];
    __IO uint32 MACTFCR;
    uint32      RESERVED5[7];
    __IO uint32 MACRFCR;
    uint32      RESERVED6[7];
    __IO uint32 MACISR;
    __IO uint32 MACIER;
    __IO uint32 MACRXTXSR;
    uint32      RESERVED7;
    __IO uint32 MACPCSR;
    __IO uint32 MACRWKPFR;
    uint32      RESERVED8[2];
    __IO uint32 MACLCSR;
    __IO uint32 MACLTCR;
    __IO uint32 MACLETR;
    __IO uint32 MAC1USTCR;
    uint32      RESERVED9[12];
    __IO uint32 MACVR;
    __IO uint32 MACDR;
    uint32      RESERVED10;
    __IO uint32 MACHWF0R;
    __IO uint32 MACHWF1R;
    __IO uint32 MACHWF2R;
    uint32      RESERVED11[54];
    __IO uint32 MACMDIOAR;
    __IO uint32 MACMDIODR;
    uint32      RESERVED12[2];
    __IO uint32 MACARPAR;
    uint32      RESERVED13[59];
    __IO uint32 MACA0HR;
    __IO uint32 MACA0LR;
    __IO uint32 MACA1HR;
    __IO uint32 MACA1LR;
    __IO uint32 MACA2HR;
    __IO uint32 MACA2LR;
    __IO uint32 MACA3HR;
    __IO uint32 MACA3LR;
    uint32      RESERVED14[248];
    __IO uint32 MMCCR;
    __IO uint32 MMCRIR;
    __IO uint32 MMCTIR;
    __IO uint32 MMCRIMR;
    __IO uint32 MMCTIMR;
    uint32      RESERVED15[14];
    __IO uint32 MMCTSCGPR;
    __IO uint32 MMCTMCGPR;
    uint32      RESERVED16[5];
    __IO uint32 MMCTPCGR;
    uint32      RESERVED17[10];
    __IO uint32 MMCRCRCEPR;
    __IO uint32 MMCRAEPR;
    uint32      RESERVED18[10];
    __IO uint32 MMCRUPGR;
    uint32      RESERVED19[9];
    __IO uint32 MMCTLPIMSTR;
    __IO uint32 MMCTLPITCR;
    __IO uint32 MMCRLPIMSTR;
    __IO uint32 MMCRLPITCR;
    uint32      RESERVED20[65];
    __IO uint32 MACL3L4C0R;
    __IO uint32 MACL4A0R;
    uint32      RESERVED21[2];
    __IO uint32 MACL3A0R0R;
    __IO uint32 MACL3A1R0R;
    __IO uint32 MACL3A2R0R;
    __IO uint32 MACL3A3R0R;
    uint32      RESERVED22[4];
    __IO uint32 MACL3L4C1R;
    __IO uint32 MACL4A1R;
    uint32      RESERVED23[2];
    __IO uint32 MACL3A0R1R;
    __IO uint32 MACL3A1R1R;
    __IO uint32 MACL3A2R1R;
    __IO uint32 MACL3A3R1R;
    uint32      RESERVED24[108];
    __IO uint32 MACTSCR;
    __IO uint32 MACSSIR;
    __IO uint32 MACSTSR;
    __IO uint32 MACSTNR;
    __IO uint32 MACSTSUR;
    __IO uint32 MACSTNUR;
    __IO uint32 MACTSAR;
    uint32      RESERVED25;
    __IO uint32 MACTSSR;
    uint32      RESERVED26[3];
    __IO uint32 MACTTSSNR;
    __IO uint32 MACTTSSSR;
    uint32      RESERVED27[2];
    __IO uint32 MACACR;
    uint32      RESERVED28;
    __IO uint32 MACATSNR;
    __IO uint32 MACATSSR;
    __IO uint32 MACTSIACR;
    __IO uint32 MACTSEACR;
    __IO uint32 MACTSICNR;
    __IO uint32 MACTSECNR;
    uint32      RESERVED29[4];
    __IO uint32 MACPPSCR;
    uint32      RESERVED30[3];
    __IO uint32 MACPPSTTSR;
    __IO uint32 MACPPSTTNR;
    __IO uint32 MACPPSIR;
    __IO uint32 MACPPSWR;
    uint32      RESERVED31[12];
    __IO uint32 MACPOCR;
    __IO uint32 MACSPI0R;
    __IO uint32 MACSPI1R;
    __IO uint32 MACSPI2R;
    __IO uint32 MACLMIR;
    uint32      RESERVED32[11];
    __IO uint32 MTLOMR;
    uint32      RESERVED33[7];
    __IO uint32 MTLISR;
    uint32      RESERVED34[55];
    __IO uint32 MTLTQOMR;
    __IO uint32 MTLTQUR;
    __IO uint32 MTLTQDR;
    uint32      RESERVED35[8];
    __IO uint32 MTLQICSR;
    __IO uint32 MTLRQOMR;
    __IO uint32 MTLRQMPOCR;
    __IO uint32 MTLRQDR;
    uint32      RESERVED36[177];
    __IO uint32 DMAMR;
    __IO uint32 DMASBMR;
    __IO uint32 DMAISR;
    __IO uint32 DMADSR;
    uint32      RESERVED37[60];
    __IO uint32 DMACCR;
    __IO uint32 DMACTCR;
    __IO uint32 DMACRCR;
    uint32      RESERVED38[2];
    __IO uint32 DMACTDLAR;
    uint32      RESERVED39;
    __IO uint32 DMACRDLAR;
    __IO uint32 DMACTDTPR;
    uint32      RESERVED40;
    __IO uint32 DMACRDTPR;
    __IO uint32 DMACTDRLR;
    __IO uint32 DMACRDRLR;
    __IO uint32 DMACIER;
    __IO uint32 DMACRIWTR;
    __IO uint32 DMACSFCSR;
    uint32      RESERVED41;
    __IO uint32 DMACCATDR;
    uint32      RESERVED42;
    __IO uint32 DMACCARDR;
    uint32      RESERVED43;
    __IO uint32 DMACCATBR;
    uint32      RESERVED44;
    __IO uint32 DMACCARBR;
    __IO uint32 DMACSR;
    uint32      RESERVED45[2];
    __IO uint32 DMACMFCR;
}ETH_TypeDef;

typedef struct
{
    __IO uint32 RTSR1;               /*!< EXTI Rising trigger selection register,          Address offset: 0x00 */
    __IO uint32 FTSR1;               /*!< EXTI Falling trigger selection register,         Address offset: 0x04 */
    __IO uint32 SWIER1;              /*!< EXTI Software interrupt event register,          Address offset: 0x08 */
    __IO uint32 D3PMR1;              /*!< EXTI D3 Pending mask register, (same register as to SRDPMR1) Address offset: 0x0C */
    __IO uint32 D3PCR1L;             /*!< EXTI D3 Pending clear selection register low, (same register as to SRDPCR1L)     Address offset: 0x10 */
    __IO uint32 D3PCR1H;             /*!< EXTI D3 Pending clear selection register High, (same register as to SRDPCR1H)   Address offset: 0x14 */
    uint32      RESERVED1[2];        /*!< Reserved,                                        0x18 to 0x1C         */
    __IO uint32 RTSR2;               /*!< EXTI Rising trigger selection register,          Address offset: 0x20 */
    __IO uint32 FTSR2;               /*!< EXTI Falling trigger selection register,         Address offset: 0x24 */
    __IO uint32 SWIER2;              /*!< EXTI Software interrupt event register,          Address offset: 0x28 */
    __IO uint32 D3PMR2;              /*!< EXTI D3 Pending mask register, (same register as to SRDPMR2) Address offset: 0x2C */
    __IO uint32 D3PCR2L;             /*!< EXTI D3 Pending clear selection register low, (same register as to SRDPCR2L)  Address offset: 0x30 */
    __IO uint32 D3PCR2H;             /*!< EXTI D3 Pending clear selection register High, (same register as to SRDPCR2H) Address offset: 0x34 */
    uint32      RESERVED2[2];        /*!< Reserved,                                        0x38 to 0x3C         */
    __IO uint32 RTSR3;               /*!< EXTI Rising trigger selection register,          Address offset: 0x40 */
    __IO uint32 FTSR3;               /*!< EXTI Falling trigger selection register,         Address offset: 0x44 */
    __IO uint32 SWIER3;              /*!< EXTI Software interrupt event register,          Address offset: 0x48 */
    __IO uint32 D3PMR3;              /*!< EXTI D3 Pending mask register, (same register as to SRDPMR3) Address offset: 0x4C */
    __IO uint32 D3PCR3L;             /*!< EXTI D3 Pending clear selection register low, (same register as to SRDPCR3L) Address offset: 0x50 */
    __IO uint32 D3PCR3H;             /*!< EXTI D3 Pending clear selection register High, (same register as to SRDPCR3H) Address offset: 0x54 */
    uint32      RESERVED3[10];       /*!< Reserved,                                        0x58 to 0x7C         */
    __IO uint32 IMR1;                /*!< EXTI Interrupt mask register,                    Address offset: 0x80 */
    __IO uint32 EMR1;                /*!< EXTI Event mask register,                        Address offset: 0x84 */
    __IO uint32 PR1;                 /*!< EXTI Pending register,                           Address offset: 0x88 */
    uint32      RESERVED4;           /*!< Reserved,                                        0x8C                 */
    __IO uint32 IMR2;                /*!< EXTI Interrupt mask register,                    Address offset: 0x90 */
    __IO uint32 EMR2;                /*!< EXTI Event mask register,                        Address offset: 0x94 */
    __IO uint32 PR2;                 /*!< EXTI Pending register,                           Address offset: 0x98 */
    uint32      RESERVED5;           /*!< Reserved,                                        0x9C                 */
    __IO uint32 IMR3;                /*!< EXTI Interrupt mask register,                    Address offset: 0xA0 */
    __IO uint32 EMR3;                /*!< EXTI Event mask register,                        Address offset: 0xA4 */
    __IO uint32 PR3;                 /*!< EXTI Pending register,                           Address offset: 0xA8 */
}EXTI_TypeDef;

typedef struct
{
    __IO uint32 IMR1;                /*!< EXTI Interrupt mask register,                Address offset: 0x00 */
    __IO uint32 EMR1;                /*!< EXTI Event mask register,                    Address offset: 0x04 */
    __IO uint32 PR1;                 /*!< EXTI Pending register,                       Address offset: 0x08 */
    uint32      RESERVED1;           /*!< Reserved, 0x0C                                                    */
    __IO uint32 IMR2;                /*!< EXTI Interrupt mask register,                Address offset: 0x10 */
    __IO uint32 EMR2;                /*!< EXTI Event mask register,                    Address offset: 0x14 */
    __IO uint32 PR2;                 /*!< EXTI Pending register,                       Address offset: 0x18 */
    uint32      RESERVED2;           /*!< Reserved, 0x1C                                                    */
    __IO uint32 IMR3;                /*!< EXTI Interrupt mask register,                Address offset: 0x20 */
    __IO uint32 EMR3;                /*!< EXTI Event mask register,                    Address offset: 0x24 */
    __IO uint32 PR3;                 /*!< EXTI Pending register,                       Address offset: 0x28 */
}EXTI_Core_TypeDef;

