NETNABI-PJ/PBOT/PJ_DCB/DCB_STM32H723ZG/Code/Core/stm32h723xx_reg.h
typedef struct
{
    __IO uint32 ACR;             /*!< FLASH access control register,                            Address offset: 0x00  */
    __IO uint32 KEYR1;           /*!< Flash Key Register for bank1,                             Address offset: 0x04  */
    __IO uint32 OPTKEYR;         /*!< Flash Option Key Register,                                Address offset: 0x08  */
    __IO uint32 CR1;             /*!< Flash Control Register for bank1,                         Address offset: 0x0C  */
    __IO uint32 SR1;             /*!< Flash Status Register for bank1,                          Address offset: 0x10  */
    __IO uint32 CCR1;            /*!< Flash Control Register for bank1,                         Address offset: 0x14  */
    __IO uint32 OPTCR;           /*!< Flash Option Control Register,                            Address offset: 0x18  */
    __IO uint32 OPTSR_CUR;       /*!< Flash Option Status Current Register,                     Address offset: 0x1C  */
    __IO uint32 OPTSR_PRG;       /*!< Flash Option Status to Program Register,                  Address offset: 0x20  */
    __IO uint32 OPTCCR;          /*!< Flash Option Clear Control Register,                      Address offset: 0x24  */
    __IO uint32 PRAR_CUR1;       /*!< Flash Current Protection Address Register for bank1,      Address offset: 0x28  */
    __IO uint32 PRAR_PRG1;       /*!< Flash Protection Address to Program Register for bank1,   Address offset: 0x2C  */
    __IO uint32 SCAR_CUR1;       /*!< Flash Current Secure Address Register for bank1,          Address offset: 0x30  */
    __IO uint32 SCAR_PRG1;       /*!< Flash Secure Address to Program Register for bank1,       Address offset: 0x34  */
    __IO uint32 WPSN_CUR1;       /*!< Flash Current Write Protection Register on bank1,         Address offset: 0x38  */
    __IO uint32 WPSN_PRG1;       /*!< Flash Write Protection to Program Register on bank1,      Address offset: 0x3C  */
    __IO uint32 BOOT_CUR;        /*!< Flash Current Boot Address for Pelican Core Register,     Address offset: 0x40  */
    __IO uint32 BOOT_PRG;        /*!< Flash Boot Address to Program for Pelican Core Register,  Address offset: 0x44  */
    uint32      RESERVED0[2];    /*!< Reserved, 0x48 to 0x4C                                                          */
    __IO uint32 CRCCR1;          /*!< Flash CRC Control register For Bank1 Register ,           Address offset: 0x50  */
    __IO uint32 CRCSADD1;        /*!< Flash CRC Start Address Register for Bank1 ,              Address offset: 0x54  */
    __IO uint32 CRCEADD1;        /*!< Flash CRC End Address Register for Bank1 ,                Address offset: 0x58  */
    __IO uint32 CRCDATA;         /*!< Flash CRC Data Register for Bank1 ,                       Address offset: 0x5C  */
    __IO uint32 ECC_FA1;         /*!< Flash ECC Fail Address For Bank1 Register ,               Address offset: 0x60  */
    uint32      RESERVED[3];     /*!< Reserved, 0x64 to 0x6C                                                          */
    __IO uint32 OPTSR2_CUR;      /*!< Flash Option Status Current Register 2,                   Address offset: 0x70  */
    __IO uint32 OPTSR2_PRG;      /*!< Flash Option Status to Program Register 2,                Address offset: 0x74  */
} FLASH_TypeDef;

typedef struct
{
    __IO uint32 X1BUFCFG;        /*!< FMAC X1 Buffer Configuration register, Address offset: 0x00          */
    __IO uint32 X2BUFCFG;        /*!< FMAC X2 Buffer Configuration register, Address offset: 0x04          */
    __IO uint32 YBUFCFG;         /*!< FMAC Y Buffer Configuration register,  Address offset: 0x08          */
    __IO uint32 PARAM;           /*!< FMAC Parameter register,               Address offset: 0x0C          */
    __IO uint32 CR;              /*!< FMAC Control register,                 Address offset: 0x10          */
    __IO uint32 SR;              /*!< FMAC Status register,                  Address offset: 0x14          */
    __IO uint32 WDATA;           /*!< FMAC Write Data register,              Address offset: 0x18          */
    __IO uint32 RDATA;           /*!< FMAC Read Data register,               Address offset: 0x1C          */
} FMAC_TypeDef;

typedef struct
{
    __IO uint32 BTCR[8];    /*!< NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C */
} FMC_Bank1_TypeDef;

typedef struct
{
    __IO uint32 BWTR[7];    /*!< NOR/PSRAM write timing registers, Address offset: 0x104-0x11C */
} FMC_Bank1E_TypeDef;

typedef struct
{
    __IO uint32 PCR2;       /*!< NAND Flash control register 2,                       Address offset: 0x60 */
    __IO uint32 SR2;        /*!< NAND Flash FIFO status and interrupt register 2,     Address offset: 0x64 */
    __IO uint32 PMEM2;      /*!< NAND Flash Common memory space timing register 2,    Address offset: 0x68 */
    __IO uint32 PATT2;      /*!< NAND Flash Attribute memory space timing register 2, Address offset: 0x6C */
    uint32      RESERVED0;  /*!< Reserved, 0x70                                                            */
    __IO uint32 ECCR2;      /*!< NAND Flash ECC result registers 2,                   Address offset: 0x74 */
} FMC_Bank2_TypeDef;

typedef struct
{
    __IO uint32 PCR;       /*!< NAND Flash control register 3,                       Address offset: 0x80 */
    __IO uint32 SR;        /*!< NAND Flash FIFO status and interrupt register 3,     Address offset: 0x84 */
    __IO uint32 PMEM;      /*!< NAND Flash Common memory space timing register 3,    Address offset: 0x88 */
    __IO uint32 PATT;      /*!< NAND Flash Attribute memory space timing register 3, Address offset: 0x8C */
    uint32      RESERVED;  /*!< Reserved, 0x90                                                            */
    __IO uint32 ECCR;      /*!< NAND Flash ECC result registers 3,                   Address offset: 0x94 */
} FMC_Bank3_TypeDef;

typedef struct
{
    __IO uint32 SDCR[2];        /*!< SDRAM Control registers ,      Address offset: 0x140-0x144  */
    __IO uint32 SDTR[2];        /*!< SDRAM Timing registers ,       Address offset: 0x148-0x14C  */
    __IO uint32 SDCMR;       /*!< SDRAM Command Mode register,    Address offset: 0x150  */
    __IO uint32 SDRTR;       /*!< SDRAM Refresh Timer register,   Address offset: 0x154  */
    __IO uint32 SDSR;        /*!< SDRAM Status register,          Address offset: 0x158  */
} FMC_Bank5_6_TypeDef;

typedef struct
{
    __IO uint32 MODER;    /*!< GPIO port mode register,               Address offset: 0x00      */
    __IO uint32 OTYPER;   /*!< GPIO port output type register,        Address offset: 0x04      */
    __IO uint32 OSPEEDR;  /*!< GPIO port output speed register,       Address offset: 0x08      */
    __IO uint32 PUPDR;    /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
    __IO uint32 IDR;      /*!< GPIO port input data register,         Address offset: 0x10      */
    __IO uint32 ODR;      /*!< GPIO port output data register,        Address offset: 0x14      */
    __IO uint32 BSRR;     /*!< GPIO port bit set/reset,               Address offset: 0x18      */
    __IO uint32 LCKR;     /*!< GPIO port configuration lock register, Address offset: 0x1C      */
    __IO uint32 AFR[2];   /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
} GPIO_TypeDef;

typedef struct
{
    __IO uint32 CSR;          /*!< OPAMP control/status register,                      Address offset: 0x00 */
    __IO uint32 OTR;          /*!< OPAMP offset trimming register for normal mode,     Address offset: 0x04 */
    __IO uint32 HSOTR;        /*!< OPAMP offset trimming register for high speed mode, Address offset: 0x08 */
} OPAMP_TypeDef;

typedef struct
{
    uint32 RESERVED1;           /*!< Reserved,                                           Address offset: 0x00        */
    __IO uint32 PMCR;           /*!< SYSCFG peripheral mode configuration register,      Address offset: 0x04        */
    __IO uint32 EXTICR[4];      /*!< SYSCFG external interrupt configuration registers,  Address offset: 0x08-0x14   */
    __IO uint32 CFGR;           /*!< SYSCFG configuration registers,                     Address offset: 0x18        */
    uint32 RESERVED2;           /*!< Reserved,                                           Address offset: 0x1C        */
    __IO uint32 CCCSR;          /*!< SYSCFG compensation cell control/status register,   Address offset: 0x20        */
    __IO uint32 CCVR;           /*!< SYSCFG compensation cell value register,            Address offset: 0x24        */
    __IO uint32 CCCR;           /*!< SYSCFG compensation cell code register,             Address offset: 0x28        */
    uint32     RESERVED3;       /*!< Reserved,                                           Address offset: 0x2C        */
    __IO uint32 ADC2ALT;        /*!< ADC2 internal input alternate connection register,  Address offset: 0x30        */
    uint32     RESERVED4[60];   /*!< Reserved, 0x34-0x120                                                            */
    __IO uint32 PKGR;          /*!< SYSCFG package register,                            Address offset: 0x124       */
    uint32     RESERVED5[118]; /*!< Reserved, 0x128-0x2FC                                                           */
    __IO uint32 UR0;            /*!< SYSCFG user register 0,                             Address offset: 0x300       */
    __IO uint32 UR1;            /*!< SYSCFG user register 1,                             Address offset: 0x304       */
    __IO uint32 UR2;            /*!< SYSCFG user register 2,                             Address offset: 0x308       */
    __IO uint32 UR3;            /*!< SYSCFG user register 3,                             Address offset: 0x30C       */
    __IO uint32 UR4;            /*!< SYSCFG user register 4,                             Address offset: 0x310       */
    __IO uint32 UR5;            /*!< SYSCFG user register 5,                             Address offset: 0x314       */
    __IO uint32 UR6;            /*!< SYSCFG user register 6,                             Address offset: 0x318       */
    __IO uint32 UR7;            /*!< SYSCFG user register 7,                             Address offset: 0x31C       */
    uint32     RESERVED6[3];    /*!< Reserved,                                           Address offset: 0x320-0x328 */
    __IO uint32 UR11;           /*!< SYSCFG user register 11,                            Address offset: 0x32C       */
    __IO uint32 UR12;           /*!< SYSCFG user register 12,                            Address offset: 0x330       */
    __IO uint32 UR13;           /*!< SYSCFG user register 13,                            Address offset: 0x334       */
    __IO uint32 UR14;           /*!< SYSCFG user register 14,                            Address offset: 0x338       */
    __IO uint32 UR15;           /*!< SYSCFG user register 15,                            Address offset: 0x33C       */
    __IO uint32 UR16;           /*!< SYSCFG user register 16,                            Address offset: 0x340       */
    __IO uint32 UR17;           /*!< SYSCFG user register 17,                            Address offset: 0x344       */
    __IO uint32 UR18;           /*!< SYSCFG user register 18,                            Address offset: 0x348       */
} SYSCFG_TypeDef;

typedef struct
{
    __IO uint32 CR1;      /*!< I2C Control register 1,            Address offset: 0x00 */
    __IO uint32 CR2;      /*!< I2C Control register 2,            Address offset: 0x04 */
    __IO uint32 OAR1;     /*!< I2C Own address 1 register,        Address offset: 0x08 */
    __IO uint32 OAR2;     /*!< I2C Own address 2 register,        Address offset: 0x0C */
    __IO uint32 TIMINGR;  /*!< I2C Timing register,               Address offset: 0x10 */
    __IO uint32 TIMEOUTR; /*!< I2C Timeout register,              Address offset: 0x14 */
    __IO uint32 ISR;      /*!< I2C Interrupt and status register, Address offset: 0x18 */
    __IO uint32 ICR;      /*!< I2C Interrupt clear register,      Address offset: 0x1C */
    __IO uint32 PECR;     /*!< I2C PEC register,                  Address offset: 0x20 */
    __IO uint32 RXDR;     /*!< I2C Receive data register,         Address offset: 0x24 */
    __IO uint32 TXDR;     /*!< I2C Transmit data register,        Address offset: 0x28 */
} I2C_TypeDef;

typedef struct
{
    __IO uint32 KR;   /*!< IWDG Key register,       Address offset: 0x00 */
    __IO uint32 PR;   /*!< IWDG Prescaler register, Address offset: 0x04 */
    __IO uint32 RLR;  /*!< IWDG Reload register,    Address offset: 0x08 */
    __IO uint32 SR;   /*!< IWDG Status register,    Address offset: 0x0C */
    __IO uint32 WINR; /*!< IWDG Window register,    Address offset: 0x10 */
} IWDG_TypeDef;

typedef struct
{
    uint32      RESERVED0[2];  /*!< Reserved, 0x00-0x04                                                       */
    __IO uint32 SSCR;          /*!< LTDC Synchronization Size Configuration Register,    Address offset: 0x08 */
    __IO uint32 BPCR;          /*!< LTDC Back Porch Configuration Register,              Address offset: 0x0C */
    __IO uint32 AWCR;          /*!< LTDC Active Width Configuration Register,            Address offset: 0x10 */
    __IO uint32 TWCR;          /*!< LTDC Total Width Configuration Register,             Address offset: 0x14 */
    __IO uint32 GCR;           /*!< LTDC Global Control Register,                        Address offset: 0x18 */
    uint32      RESERVED1[2];  /*!< Reserved, 0x1C-0x20                                                       */
    __IO uint32 SRCR;          /*!< LTDC Shadow Reload Configuration Register,           Address offset: 0x24 */
    uint32      RESERVED2[1];  /*!< Reserved, 0x28                                                            */
    __IO uint32 BCCR;          /*!< LTDC Background Color Configuration Register,        Address offset: 0x2C */
    uint32      RESERVED3[1];  /*!< Reserved, 0x30                                                            */
    __IO uint32 IER;           /*!< LTDC Interrupt Enable Register,                      Address offset: 0x34 */
    __IO uint32 ISR;           /*!< LTDC Interrupt Status Register,                      Address offset: 0x38 */
    __IO uint32 ICR;           /*!< LTDC Interrupt Clear Register,                       Address offset: 0x3C */
    __IO uint32 LIPCR;         /*!< LTDC Line Interrupt Position Configuration Register, Address offset: 0x40 */
    __IO uint32 CPSR;          /*!< LTDC Current Position Status Register,               Address offset: 0x44 */
    __IO uint32 CDSR;         /*!< LTDC Current Display Status Register,                 Address offset: 0x48 */
} LTDC_TypeDef;

typedef struct
{
    __IO uint32 CR;            /*!< LTDC Layerx Control Register                                  Address offset: 0x84 */
    __IO uint32 WHPCR;         /*!< LTDC Layerx Window Horizontal Position Configuration Register Address offset: 0x88 */
    __IO uint32 WVPCR;         /*!< LTDC Layerx Window Vertical Position Configuration Register   Address offset: 0x8C */
    __IO uint32 CKCR;          /*!< LTDC Layerx Color Keying Configuration Register               Address offset: 0x90 */
    __IO uint32 PFCR;          /*!< LTDC Layerx Pixel Format Configuration Register               Address offset: 0x94 */
    __IO uint32 CACR;          /*!< LTDC Layerx Constant Alpha Configuration Register             Address offset: 0x98 */
    __IO uint32 DCCR;          /*!< LTDC Layerx Default Color Configuration Register              Address offset: 0x9C */
    __IO uint32 BFCR;          /*!< LTDC Layerx Blending Factors Configuration Register           Address offset: 0xA0 */
    uint32      RESERVED0[2];  /*!< Reserved */
    __IO uint32 CFBAR;         /*!< LTDC Layerx Color Frame Buffer Address Register               Address offset: 0xAC */
    __IO uint32 CFBLR;         /*!< LTDC Layerx Color Frame Buffer Length Register                Address offset: 0xB0 */
    __IO uint32 CFBLNR;        /*!< LTDC Layerx ColorFrame Buffer Line Number Register            Address offset: 0xB4 */
    uint32      RESERVED1[3];  /*!< Reserved */
    __IO uint32 CLUTWR;         /*!< LTDC Layerx CLUT Write Register                               Address offset: 0x144 */
} LTDC_Layer_TypeDef;

typedef struct
{
    __IO uint32 CR1;       /*!< PWR power control register 1,            Address offset: 0x00 */
    __IO uint32 CSR1;      /*!< PWR power control status register 1,     Address offset: 0x04 */
    __IO uint32 CR2;       /*!< PWR power control register 2,            Address offset: 0x08 */
    __IO uint32 CR3;       /*!< PWR power control register 3,            Address offset: 0x0C */
    __IO uint32 CPUCR;     /*!< PWR CPU control register,                Address offset: 0x10 */
        uint32 RESERVED0; /*!< Reserved,                                Address offset: 0x14 */
    __IO uint32 D3CR;      /*!< PWR D3 domain control register,          Address offset: 0x18 */
        uint32 RESERVED1; /*!< Reserved,                                Address offset: 0x1C */
    __IO uint32 WKUPCR;    /*!< PWR wakeup clear register,               Address offset: 0x20 */
    __IO uint32 WKUPFR;    /*!< PWR wakeup flag register,                Address offset: 0x24 */
    __IO uint32 WKUPEPR;   /*!< PWR wakeup enable and polarity register, Address offset: 0x28 */
} PWR_TypeDef;

