NETNABI-PJ/PBOT/PJ_DCB/DCB_STM32H723ZG/Code/Core/stm32h723xx_reg.h
typedef struct
{
    __IO uint32 CR;             /*!< RCC clock control register,                                              Address offset: 0x00  */
    __IO uint32 HSICFGR;        /*!< HSI Clock Calibration Register,                                          Address offset: 0x04  */
    __IO uint32 CRRCR;          /*!< Clock Recovery RC  Register,                                             Address offset: 0x08  */
    __IO uint32 CSICFGR;        /*!< CSI Clock Calibration Register,                                          Address offset: 0x0C  */
    __IO uint32 CFGR;           /*!< RCC clock configuration register,                                        Address offset: 0x10  */
    uint32     RESERVED1;       /*!< Reserved,                                                                Address offset: 0x14  */
    __IO uint32 D1CFGR;         /*!< RCC Domain 1 configuration register,                                     Address offset: 0x18  */
    __IO uint32 D2CFGR;         /*!< RCC Domain 2 configuration register,                                     Address offset: 0x1C  */
    __IO uint32 D3CFGR;         /*!< RCC Domain 3 configuration register,                                     Address offset: 0x20  */
    uint32     RESERVED2;       /*!< Reserved,                                                                Address offset: 0x24  */
    __IO uint32 PLLCKSELR;      /*!< RCC PLLs Clock Source Selection Register,                                Address offset: 0x28  */
    __IO uint32 PLLCFGR;        /*!< RCC PLLs  Configuration Register,                                        Address offset: 0x2C  */
    __IO uint32 PLL1DIVR;       /*!< RCC PLL1 Dividers Configuration Register,                                Address offset: 0x30  */
    __IO uint32 PLL1FRACR;      /*!< RCC PLL1 Fractional Divider Configuration Register,                      Address offset: 0x34  */
    __IO uint32 PLL2DIVR;       /*!< RCC PLL2 Dividers Configuration Register,                                Address offset: 0x38  */
    __IO uint32 PLL2FRACR;      /*!< RCC PLL2 Fractional Divider Configuration Register,                      Address offset: 0x3C  */
    __IO uint32 PLL3DIVR;       /*!< RCC PLL3 Dividers Configuration Register,                                Address offset: 0x40  */
    __IO uint32 PLL3FRACR;      /*!< RCC PLL3 Fractional Divider Configuration Register,                      Address offset: 0x44  */
    uint32      RESERVED3;      /*!< Reserved,                                                                Address offset: 0x48  */
    __IO uint32  D1CCIPR;       /*!< RCC Domain 1 Kernel Clock Configuration Register                         Address offset: 0x4C  */
    __IO uint32  D2CCIP1R;      /*!< RCC Domain 2 Kernel Clock Configuration Register                         Address offset: 0x50  */
    __IO uint32  D2CCIP2R;      /*!< RCC Domain 2 Kernel Clock Configuration Register                         Address offset: 0x54  */
    __IO uint32  D3CCIPR;       /*!< RCC Domain 3 Kernel Clock Configuration Register                         Address offset: 0x58  */
    uint32      RESERVED4;      /*!< Reserved,                                                                Address offset: 0x5C  */
    __IO uint32  CIER;          /*!< RCC Clock Source Interrupt Enable Register                               Address offset: 0x60  */
    __IO uint32  CIFR;          /*!< RCC Clock Source Interrupt Flag Register                                 Address offset: 0x64  */
    __IO uint32  CICR;          /*!< RCC Clock Source Interrupt Clear Register                                Address offset: 0x68  */
    uint32     RESERVED5;       /*!< Reserved,                                                                Address offset: 0x6C  */
    __IO uint32  BDCR;          /*!< RCC Vswitch Backup Domain Control Register,                              Address offset: 0x70  */
    __IO uint32  CSR;           /*!< RCC clock control & status register,                                     Address offset: 0x74  */
    uint32     RESERVED6;       /*!< Reserved,                                                                Address offset: 0x78  */
    __IO uint32 AHB3RSTR;       /*!< RCC AHB3 peripheral reset register,                                      Address offset: 0x7C  */
    __IO uint32 AHB1RSTR;       /*!< RCC AHB1 peripheral reset register,                                      Address offset: 0x80  */
    __IO uint32 AHB2RSTR;       /*!< RCC AHB2 peripheral reset register,                                      Address offset: 0x84  */
    __IO uint32 AHB4RSTR;       /*!< RCC AHB4 peripheral reset register,                                      Address offset: 0x88  */
    __IO uint32 APB3RSTR;       /*!< RCC APB3 peripheral reset register,                                      Address offset: 0x8C  */
    __IO uint32 APB1LRSTR;      /*!< RCC APB1 peripheral reset Low Word register,                             Address offset: 0x90  */
    __IO uint32 APB1HRSTR;      /*!< RCC APB1 peripheral reset High Word register,                            Address offset: 0x94  */
    __IO uint32 APB2RSTR;       /*!< RCC APB2 peripheral reset register,                                      Address offset: 0x98  */
    __IO uint32 APB4RSTR;       /*!< RCC APB4 peripheral reset register,                                      Address offset: 0x9C  */
    __IO uint32 GCR;            /*!< RCC RCC Global Control  Register,                                        Address offset: 0xA0  */
    uint32     RESERVED8;       /*!< Reserved,                                                                Address offset: 0xA4  */
    __IO uint32 D3AMR;          /*!< RCC Domain 3 Autonomous Mode Register,                                   Address offset: 0xA8  */
    uint32     RESERVED11[9];    /*!< Reserved, 0xAC-0xCC                                                      Address offset: 0xAC  */
    __IO uint32 RSR;            /*!< RCC Reset status register,                                               Address offset: 0xD0  */
    __IO uint32 AHB3ENR;        /*!< RCC AHB3 peripheral clock  register,                                     Address offset: 0xD4  */
    __IO uint32 AHB1ENR;        /*!< RCC AHB1 peripheral clock  register,                                     Address offset: 0xD8  */
    __IO uint32 AHB2ENR;        /*!< RCC AHB2 peripheral clock  register,                                     Address offset: 0xDC  */
    __IO uint32 AHB4ENR;        /*!< RCC AHB4 peripheral clock  register,                                     Address offset: 0xE0  */
    __IO uint32 APB3ENR;        /*!< RCC APB3 peripheral clock  register,                                     Address offset: 0xE4  */
    __IO uint32 APB1LENR;       /*!< RCC APB1 peripheral clock  Low Word register,                            Address offset: 0xE8  */
    __IO uint32 APB1HENR;       /*!< RCC APB1 peripheral clock  High Word register,                           Address offset: 0xEC  */
    __IO uint32 APB2ENR;        /*!< RCC APB2 peripheral clock  register,                                     Address offset: 0xF0  */
    __IO uint32 APB4ENR;        /*!< RCC APB4 peripheral clock  register,                                     Address offset: 0xF4  */
    uint32      RESERVED12;      /*!< Reserved,                                                                Address offset: 0xF8  */
    __IO uint32 AHB3LPENR;      /*!< RCC AHB3 peripheral sleep clock  register,                               Address offset: 0xFC  */
    __IO uint32 AHB1LPENR;      /*!< RCC AHB1 peripheral sleep clock  register,                               Address offset: 0x100 */
    __IO uint32 AHB2LPENR;      /*!< RCC AHB2 peripheral sleep clock  register,                               Address offset: 0x104 */
    __IO uint32 AHB4LPENR;      /*!< RCC AHB4 peripheral sleep clock  register,                               Address offset: 0x108 */
    __IO uint32 APB3LPENR;      /*!< RCC APB3 peripheral sleep clock  register,                               Address offset: 0x10C */
    __IO uint32 APB1LLPENR;     /*!< RCC APB1 peripheral sleep clock  Low Word register,                      Address offset: 0x110 */
    __IO uint32 APB1HLPENR;     /*!< RCC APB1 peripheral sleep clock  High Word register,                     Address offset: 0x114 */
    __IO uint32 APB2LPENR;      /*!< RCC APB2 peripheral sleep clock  register,                               Address offset: 0x118 */
    __IO uint32 APB4LPENR;      /*!< RCC APB4 peripheral sleep clock  register,                               Address offset: 0x11C */
    uint32     RESERVED13[4];   /*!< Reserved, 0x120-0x12C                                                    Address offset: 0x120 */
} RCC_TypeDef;

typedef struct
{
    __IO uint32 TR;         /*!< RTC time register,                                         Address offset: 0x00 */
    __IO uint32 DR;         /*!< RTC date register,                                         Address offset: 0x04 */
    __IO uint32 CR;         /*!< RTC control register,                                      Address offset: 0x08 */
    __IO uint32 ISR;        /*!< RTC initialization and status register,                    Address offset: 0x0C */
    __IO uint32 PRER;       /*!< RTC prescaler register,                                    Address offset: 0x10 */
    __IO uint32 WUTR;       /*!< RTC wakeup timer register,                                 Address offset: 0x14 */
        uint32 RESERVED;   /*!< Reserved,                                                  Address offset: 0x18 */
    __IO uint32 ALRMAR;     /*!< RTC alarm A register,                                      Address offset: 0x1C */
    __IO uint32 ALRMBR;     /*!< RTC alarm B register,                                      Address offset: 0x20 */
    __IO uint32 WPR;        /*!< RTC write protection register,                             Address offset: 0x24 */
    __IO uint32 SSR;        /*!< RTC sub second register,                                   Address offset: 0x28 */
    __IO uint32 SHIFTR;     /*!< RTC shift control register,                                Address offset: 0x2C */
    __IO uint32 TSTR;       /*!< RTC time stamp time register,                              Address offset: 0x30 */
    __IO uint32 TSDR;       /*!< RTC time stamp date register,                              Address offset: 0x34 */
    __IO uint32 TSSSR;      /*!< RTC time-stamp sub second register,                        Address offset: 0x38 */
    __IO uint32 CALR;       /*!< RTC calibration register,                                  Address offset: 0x3C */
    __IO uint32 TAMPCR;     /*!< RTC tamper configuration register,                         Address offset: 0x40 */
    __IO uint32 ALRMASSR;   /*!< RTC alarm A sub second register,                           Address offset: 0x44 */
    __IO uint32 ALRMBSSR;   /*!< RTC alarm B sub second register,                           Address offset: 0x48 */
    __IO uint32 OR;         /*!< RTC option register,                                       Address offset: 0x4C */
    __IO uint32 BKP0R;      /*!< RTC backup register 0,                                     Address offset: 0x50 */
    __IO uint32 BKP1R;      /*!< RTC backup register 1,                                     Address offset: 0x54 */
    __IO uint32 BKP2R;      /*!< RTC backup register 2,                                     Address offset: 0x58 */
    __IO uint32 BKP3R;      /*!< RTC backup register 3,                                     Address offset: 0x5C */
    __IO uint32 BKP4R;      /*!< RTC backup register 4,                                     Address offset: 0x60 */
    __IO uint32 BKP5R;      /*!< RTC backup register 5,                                     Address offset: 0x64 */
    __IO uint32 BKP6R;      /*!< RTC backup register 6,                                     Address offset: 0x68 */
    __IO uint32 BKP7R;      /*!< RTC backup register 7,                                     Address offset: 0x6C */
    __IO uint32 BKP8R;      /*!< RTC backup register 8,                                     Address offset: 0x70 */
    __IO uint32 BKP9R;      /*!< RTC backup register 9,                                     Address offset: 0x74 */
    __IO uint32 BKP10R;     /*!< RTC backup register 10,                                    Address offset: 0x78 */
    __IO uint32 BKP11R;     /*!< RTC backup register 11,                                    Address offset: 0x7C */
    __IO uint32 BKP12R;     /*!< RTC backup register 12,                                    Address offset: 0x80 */
    __IO uint32 BKP13R;     /*!< RTC backup register 13,                                    Address offset: 0x84 */
    __IO uint32 BKP14R;     /*!< RTC backup register 14,                                    Address offset: 0x88 */
    __IO uint32 BKP15R;     /*!< RTC backup register 15,                                    Address offset: 0x8C */
    __IO uint32 BKP16R;     /*!< RTC backup register 16,                                    Address offset: 0x90 */
    __IO uint32 BKP17R;     /*!< RTC backup register 17,                                    Address offset: 0x94 */
    __IO uint32 BKP18R;     /*!< RTC backup register 18,                                    Address offset: 0x98 */
    __IO uint32 BKP19R;     /*!< RTC backup register 19,                                    Address offset: 0x9C */
    __IO uint32 BKP20R;     /*!< RTC backup register 20,                                    Address offset: 0xA0 */
    __IO uint32 BKP21R;     /*!< RTC backup register 21,                                    Address offset: 0xA4 */
    __IO uint32 BKP22R;     /*!< RTC backup register 22,                                    Address offset: 0xA8 */
    __IO uint32 BKP23R;     /*!< RTC backup register 23,                                    Address offset: 0xAC */
    __IO uint32 BKP24R;     /*!< RTC backup register 24,                                    Address offset: 0xB0 */
    __IO uint32 BKP25R;     /*!< RTC backup register 25,                                    Address offset: 0xB4 */
    __IO uint32 BKP26R;     /*!< RTC backup register 26,                                    Address offset: 0xB8 */
    __IO uint32 BKP27R;     /*!< RTC backup register 27,                                    Address offset: 0xBC */
    __IO uint32 BKP28R;     /*!< RTC backup register 28,                                    Address offset: 0xC0 */
    __IO uint32 BKP29R;     /*!< RTC backup register 29,                                    Address offset: 0xC4 */
    __IO uint32 BKP30R;     /*!< RTC backup register 30,                                    Address offset: 0xC8 */
    __IO uint32 BKP31R;     /*!< RTC backup register 31,                                    Address offset: 0xCC */
} RTC_TypeDef;

typedef struct
{
    __IO uint32 GCR;           /*!< SAI global configuration register, Address offset: 0x00 */
    uint32      RESERVED0[16]; /*!< Reserved, 0x04 - 0x43                                   */
    __IO uint32 PDMCR;         /*!< SAI PDM control register,          Address offset: 0x44 */
    __IO uint32 PDMDLY;        /*!< SAI PDM delay register,            Address offset: 0x48 */
} SAI_TypeDef;

typedef struct
{
    __IO uint32 CR1;      /*!< SAI block x configuration register 1,     Address offset: 0x04 */
    __IO uint32 CR2;      /*!< SAI block x configuration register 2,     Address offset: 0x08 */
    __IO uint32 FRCR;     /*!< SAI block x frame configuration register, Address offset: 0x0C */
    __IO uint32 SLOTR;    /*!< SAI block x slot register,                Address offset: 0x10 */
    __IO uint32 IMR;      /*!< SAI block x interrupt mask register,      Address offset: 0x14 */
    __IO uint32 SR;       /*!< SAI block x status register,              Address offset: 0x18 */
    __IO uint32 CLRFR;    /*!< SAI block x clear flag register,          Address offset: 0x1C */
    __IO uint32 DR;       /*!< SAI block x data register,                Address offset: 0x20 */
} SAI_Block_TypeDef;

typedef struct
{
    __IO uint32   CR;           /*!< Control register,                   Address offset: 0x00 */
    __IO uint32   IMR;          /*!< Interrupt mask register,            Address offset: 0x04 */
    __IO uint32   SR;           /*!< Status register,                    Address offset: 0x08 */
    __IO uint32   IFCR;         /*!< Interrupt Flag Clear register,      Address offset: 0x0C */
    __IO uint32   DR;           /*!< Data input register,                Address offset: 0x10 */
    __IO uint32   CSR;          /*!< Channel Status register,            Address offset: 0x14 */
    __IO uint32   DIR;          /*!< Debug Information register,         Address offset: 0x18 */
    uint32        RESERVED2;    /*!< Reserved,  0x1A                                          */
} SPDIFRX_TypeDef;

typedef struct
{
    __IO uint32 POWER;          /*!< SDMMC power control register,             Address offset: 0x00  */
    __IO uint32 CLKCR;          /*!< SDMMC clock control register,             Address offset: 0x04  */
    __IO uint32 ARG;            /*!< SDMMC argument register,                  Address offset: 0x08  */
    __IO uint32 CMD;            /*!< SDMMC command register,                   Address offset: 0x0C  */
    __I uint32  RESPCMD;        /*!< SDMMC command response register,          Address offset: 0x10  */
    __I uint32  RESP1;          /*!< SDMMC response 1 register,                Address offset: 0x14  */
    __I uint32  RESP2;          /*!< SDMMC response 2 register,                Address offset: 0x18  */
    __I uint32  RESP3;          /*!< SDMMC response 3 register,                Address offset: 0x1C  */
    __I uint32  RESP4;          /*!< SDMMC response 4 register,                Address offset: 0x20  */
    __IO uint32 DTIMER;         /*!< SDMMC data timer register,                Address offset: 0x24  */
    __IO uint32 DLEN;           /*!< SDMMC data length register,               Address offset: 0x28  */
    __IO uint32 DCTRL;          /*!< SDMMC data control register,              Address offset: 0x2C  */
    __I uint32  DCOUNT;         /*!< SDMMC data counter register,              Address offset: 0x30  */
    __I uint32  STA;            /*!< SDMMC status register,                    Address offset: 0x34  */
    __IO uint32 ICR;            /*!< SDMMC interrupt clear register,           Address offset: 0x38  */
    __IO uint32 MASK;           /*!< SDMMC mask register,                      Address offset: 0x3C  */
    __IO uint32 ACKTIME;        /*!< SDMMC Acknowledgement timer register,     Address offset: 0x40  */
    uint32      RESERVED0[3];   /*!< Reserved, 0x44 - 0x4C - 0x4C                                    */
    __IO uint32 IDMACTRL;       /*!< SDMMC DMA control register,               Address offset: 0x50  */
    __IO uint32 IDMABSIZE;      /*!< SDMMC DMA buffer size register,           Address offset: 0x54  */
    __IO uint32 IDMABASE0;      /*!< SDMMC DMA buffer 0 base address register, Address offset: 0x58  */
    __IO uint32 IDMABASE1;      /*!< SDMMC DMA buffer 1 base address register, Address offset: 0x5C  */
    uint32      RESERVED1[8];   /*!< Reserved, 0x60-0x7C                                             */
    __IO uint32 FIFO;           /*!< SDMMC data FIFO register,                 Address offset: 0x80  */
    uint32      RESERVED2[222]; /*!< Reserved, 0x84-0x3F8                                            */
    __IO uint32 IPVR;           /*!< SDMMC data FIFO register,                 Address offset: 0x3FC */
} SDMMC_TypeDef;

typedef struct
{
    __IO uint32 CR;          /*!< DELAY BLOCK control register,  Address offset: 0x00 */
    __IO uint32 CFGR;        /*!< DELAY BLOCK configuration register,  Address offset: 0x04 */
} DLYB_TypeDef;

typedef struct
{
    __IO uint32 R[32];      /*!< 2-step write lock and read back registers,     Address offset: 00h-7Ch  */
    __IO uint32 RLR[32];    /*!< 1-step read lock registers,                    Address offset: 80h-FCh  */
    __IO uint32 C1IER;      /*!< HSEM Interrupt enable register ,             Address offset: 100h     */
    __IO uint32 C1ICR;      /*!< HSEM Interrupt clear register ,              Address offset: 104h     */
    __IO uint32 C1ISR;      /*!< HSEM Interrupt Status register ,             Address offset: 108h     */
    __IO uint32 C1MISR;     /*!< HSEM Interrupt Masked Status register ,      Address offset: 10Ch     */
    uint32  Reserved[12];   /* Reserved                                       Address offset: 110h-13Ch  */
    __IO uint32 CR;         /*!< HSEM Semaphore clear register ,                Address offset: 140h      */
    __IO uint32 KEYR;       /*!< HSEM Semaphore clear key register ,            Address offset: 144h      */
} HSEM_TypeDef;

typedef struct
{
    __IO uint32 IER;        /*!< HSEM interrupt enable register ,                Address offset:   0h     */
    __IO uint32 ICR;        /*!< HSEM interrupt clear register ,                 Address offset:   4h     */
    __IO uint32 ISR;        /*!< HSEM interrupt status register ,                Address offset:   8h     */
    __IO uint32 MISR;       /*!< HSEM masked interrupt status register ,         Address offset:   Ch     */
} HSEM_Common_TypeDef;

typedef struct
{
    __IO uint32 CR1;           /*!< SPI/I2S Control register 1,                      Address offset: 0x00 */
    __IO uint32 CR2;           /*!< SPI Control register 2,                          Address offset: 0x04 */
    __IO uint32 CFG1;          /*!< SPI Configuration register 1,                    Address offset: 0x08 */
    __IO uint32 CFG2;          /*!< SPI Configuration register 2,                    Address offset: 0x0C */
    __IO uint32 IER;           /*!< SPI/I2S Interrupt Enable register,               Address offset: 0x10 */
    __IO uint32 SR;            /*!< SPI/I2S Status register,                         Address offset: 0x14 */
    __IO uint32 IFCR;          /*!< SPI/I2S Interrupt/Status flags clear register,   Address offset: 0x18 */
    uint32      RESERVED0;     /*!< Reserved, 0x1C                                                        */
    __IO uint32 TXDR;          /*!< SPI/I2S Transmit data register,                  Address offset: 0x20 */
    uint32      RESERVED1[3];  /*!< Reserved, 0x24-0x2C                                                   */
    __IO uint32 RXDR;          /*!< SPI/I2S Receive data register,                   Address offset: 0x30 */
    uint32      RESERVED2[3];  /*!< Reserved, 0x34-0x3C                                                   */
    __IO uint32 CRCPOLY;       /*!< SPI CRC Polynomial register,                     Address offset: 0x40 */
    __IO uint32 TXCRC;         /*!< SPI Transmitter CRC register,                    Address offset: 0x44 */
    __IO uint32 RXCRC;         /*!< SPI Receiver CRC register,                       Address offset: 0x48 */
    __IO uint32 UDRDR;         /*!< SPI Underrun data register,                      Address offset: 0x4C */
    __IO uint32 I2SCFGR;       /*!< I2S Configuration register,                      Address offset: 0x50 */
} SPI_TypeDef;

