NETNABI-PJ/PBOT/PJ_DCB/DCB_STM32H723ZG/Code/Core/stm32h723xx_reg.h
typedef struct
{
    __IO uint32 CFGR1;         /*!< DTS configuration register,                Address offset: 0x00 */
    uint32 RESERVED0;          /*!< Reserved,                                  Address offset: 0x04 */
    __IO uint32 T0VALR1;       /*!< DTS T0 Value register,                     Address offset: 0x08 */
    uint32 RESERVED1;          /*!< Reserved,                                  Address offset: 0x0C */
    __IO uint32 RAMPVALR;      /*!< DTS Ramp value register,                   Address offset: 0x10 */
    __IO uint32 ITR1;          /*!< DTS Interrupt threshold register,          Address offset: 0x14 */
    uint32 RESERVED2;          /*!< Reserved,                                  Address offset: 0x18 */
    __IO uint32 DR;            /*!< DTS data register,                         Address offset: 0x1C */
    __IO uint32 SR;            /*!< DTS status register                        Address offset: 0x20 */
    __IO uint32 ITENR;         /*!< DTS Interrupt enable register,             Address offset: 0x24 */
    __IO uint32 ICIFR;         /*!< DTS Clear Interrupt flag register,         Address offset: 0x28 */
    __IO uint32 OR;            /*!< DTS option register 1,                     Address offset: 0x2C */
}
DTS_TypeDef;

typedef struct
{
    __IO uint32 CR1;         /*!< TIM control register 1,                   Address offset: 0x00 */
    __IO uint32 CR2;         /*!< TIM control register 2,                   Address offset: 0x04 */
    __IO uint32 SMCR;        /*!< TIM slave mode control register,          Address offset: 0x08 */
    __IO uint32 DIER;        /*!< TIM DMA/interrupt enable register,        Address offset: 0x0C */
    __IO uint32 SR;          /*!< TIM status register,                      Address offset: 0x10 */
    __IO uint32 EGR;         /*!< TIM event generation register,            Address offset: 0x14 */
    __IO uint32 CCMR1;       /*!< TIM capture/compare mode register 1,      Address offset: 0x18 */
    __IO uint32 CCMR2;       /*!< TIM capture/compare mode register 2,      Address offset: 0x1C */
    __IO uint32 CCER;        /*!< TIM capture/compare enable register,      Address offset: 0x20 */
    __IO uint32 CNT;         /*!< TIM counter register,                     Address offset: 0x24 */
    __IO uint32 PSC;         /*!< TIM prescaler,                            Address offset: 0x28 */
    __IO uint32 ARR;         /*!< TIM auto-reload register,                 Address offset: 0x2C */
    __IO uint32 RCR;         /*!< TIM repetition counter register,          Address offset: 0x30 */
    __IO uint32 CCR1;        /*!< TIM capture/compare register 1,           Address offset: 0x34 */
    __IO uint32 CCR2;        /*!< TIM capture/compare register 2,           Address offset: 0x38 */
    __IO uint32 CCR3;        /*!< TIM capture/compare register 3,           Address offset: 0x3C */
    __IO uint32 CCR4;        /*!< TIM capture/compare register 4,           Address offset: 0x40 */
    __IO uint32 BDTR;        /*!< TIM break and dead-time register,         Address offset: 0x44 */
    __IO uint32 DCR;         /*!< TIM DMA control register,                 Address offset: 0x48 */
    __IO uint32 DMAR;        /*!< TIM DMA address for full transfer,        Address offset: 0x4C */
    uint32      RESERVED1;   /*!< Reserved, 0x50                                                 */
    __IO uint32 CCMR3;       /*!< TIM capture/compare mode register 3,      Address offset: 0x54 */
    __IO uint32 CCR5;        /*!< TIM capture/compare register5,            Address offset: 0x58 */
    __IO uint32 CCR6;        /*!< TIM capture/compare register6,            Address offset: 0x5C */
    __IO uint32 AF1;         /*!< TIM alternate function option register 1, Address offset: 0x60 */
    __IO uint32 AF2;         /*!< TIM alternate function option register 2, Address offset: 0x64 */
    __IO uint32 TISEL;       /*!< TIM Input Selection register,             Address offset: 0x68 */
} TIM_TypeDef;

typedef struct
{
    __IO uint32 ISR;      /*!< LPTIM Interrupt and Status register,         Address offset: 0x00 */
    __IO uint32 ICR;      /*!< LPTIM Interrupt Clear register,              Address offset: 0x04 */
    __IO uint32 IER;      /*!< LPTIM Interrupt Enable register,             Address offset: 0x08 */
    __IO uint32 CFGR;     /*!< LPTIM Configuration register,                Address offset: 0x0C */
    __IO uint32 CR;       /*!< LPTIM Control register,                      Address offset: 0x10 */
    __IO uint32 CMP;      /*!< LPTIM Compare register,                      Address offset: 0x14 */
    __IO uint32 ARR;      /*!< LPTIM Autoreload register,                   Address offset: 0x18 */
    __IO uint32 CNT;      /*!< LPTIM Counter register,                      Address offset: 0x1C */
    uint32  RESERVED1;    /*!< Reserved, 0x20                                                    */
    __IO uint32 CFGR2;    /*!< LPTIM Configuration register,                Address offset: 0x24 */
} LPTIM_TypeDef;

typedef struct
{
    __IO uint32 SR;        /*!< Comparator status register,                    Address offset: 0x00 */
    __IO uint32 ICFR;      /*!< Comparator interrupt clear flag register,       Address offset: 0x04 */
    __IO uint32 OR;        /*!< Comparator option register,                  Address offset: 0x08 */
} COMPOPT_TypeDef;

typedef struct
{
    __IO uint32 CFGR;      /*!< Comparator configuration register  ,           Address offset: 0x00 */
} COMP_TypeDef;

typedef struct
{
    __IO uint32 CFGR;       /*!< COMP control and status register, used for bits common to several COMP instances, Address offset: 0x00 */
} COMP_Common_TypeDef;

typedef struct
{
    __IO uint32 CR1;    /*!< USART Control register 1,                 Address offset: 0x00 */
    __IO uint32 CR2;    /*!< USART Control register 2,                 Address offset: 0x04 */
    __IO uint32 CR3;    /*!< USART Control register 3,                 Address offset: 0x08 */
    __IO uint32 BRR;    /*!< USART Baud rate register,                 Address offset: 0x0C */
    __IO uint32 GTPR;   /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
    __IO uint32 RTOR;   /*!< USART Receiver Time Out register,         Address offset: 0x14 */
    __IO uint32 RQR;    /*!< USART Request register,                   Address offset: 0x18 */
    __IO uint32 ISR;    /*!< USART Interrupt and status register,      Address offset: 0x1C */
    __IO uint32 ICR;    /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
    __IO uint32 RDR;    /*!< USART Receive Data register,              Address offset: 0x24 */
    __IO uint32 TDR;    /*!< USART Transmit Data register,             Address offset: 0x28 */
    __IO uint32 PRESC;  /*!< USART clock Prescaler register,           Address offset: 0x2C */
} USART_TypeDef;

typedef struct
{
    __IO uint32 CR;          /*!< SWPMI Configuration/Control register,     Address offset: 0x00 */
    __IO uint32 BRR;         /*!< SWPMI bitrate register,                   Address offset: 0x04 */
        uint32  RESERVED1;     /*!< Reserved, 0x08                                                 */
    __IO uint32 ISR;         /*!< SWPMI Interrupt and Status register,      Address offset: 0x0C */
    __IO uint32 ICR;         /*!< SWPMI Interrupt Flag Clear register,      Address offset: 0x10 */
    __IO uint32 IER;         /*!< SWPMI Interrupt Enable register,          Address offset: 0x14 */
    __IO uint32 RFL;         /*!< SWPMI Receive Frame Length register,      Address offset: 0x18 */
    __IO uint32 TDR;         /*!< SWPMI Transmit data register,             Address offset: 0x1C */
    __IO uint32 RDR;         /*!< SWPMI Receive data register,              Address offset: 0x20 */
    __IO uint32 OR;          /*!< SWPMI Option register,                    Address offset: 0x24 */
} SWPMI_TypeDef;

typedef struct
{
    __IO uint32 CR;   /*!< WWDG Control register,       Address offset: 0x00 */
    __IO uint32 CFR;  /*!< WWDG Configuration register, Address offset: 0x04 */
    __IO uint32 SR;   /*!< WWDG Status register,        Address offset: 0x08 */
} WWDG_TypeDef;

typedef struct
{
    __IO uint32 CR;           /*!< RAMECC monitor configuration register          */
    __IO uint32 SR;           /*!< RAMECC monitor status register                 */
    __IO uint32 FAR;          /*!< RAMECC monitor failing address register        */
    __IO uint32 FDRL;         /*!< RAMECC monitor failing data low register       */
    __IO uint32 FDRH;         /*!< RAMECC monitor failing data high register      */
    __IO uint32 FECR;         /*!< RAMECC monitor failing ECC error code register */
} RAMECC_MonitorTypeDef;

typedef struct
{
    __IO uint32 IER;          /*!< RAMECC interrupt enable register */
} RAMECC_TypeDef;

typedef struct
{
    __IO uint32 CR;  /*!< RNG control register, Address offset: 0x00 */
    __IO uint32 SR;  /*!< RNG status register,  Address offset: 0x04 */
    __IO uint32 DR;  /*!< RNG data register,    Address offset: 0x08 */
    uint32 RESERVED;
    __IO uint32 HTCR;  /*!< RNG health test configuration register, Address offset: 0x10 */
} RNG_TypeDef;

typedef struct
{
    __IO uint32 CR;
    __IO uint32 WRFR;
    __IO uint32 CWRFR;
    __IO uint32 RDFR;
    __IO uint32 CRDFR;
    __IO uint32 SR;
    __IO uint32 CLRFR;
    uint32 RESERVED[57];
    __IO uint32 DINR0;
    __IO uint32 DINR1;
    __IO uint32 DINR2;
    __IO uint32 DINR3;
    __IO uint32 DINR4;
    __IO uint32 DINR5;
    __IO uint32 DINR6;
    __IO uint32 DINR7;
    __IO uint32 DINR8;
    __IO uint32 DINR9;
    __IO uint32 DINR10;
    __IO uint32 DINR11;
    __IO uint32 DINR12;
    __IO uint32 DINR13;
    __IO uint32 DINR14;
    __IO uint32 DINR15;
    __IO uint32 DINR16;
    __IO uint32 DINR17;
    __IO uint32 DINR18;
    __IO uint32 DINR19;
    __IO uint32 DINR20;
    __IO uint32 DINR21;
    __IO uint32 DINR22;
    __IO uint32 DINR23;
    __IO uint32 DINR24;
    __IO uint32 DINR25;
    __IO uint32 DINR26;
    __IO uint32 DINR27;
    __IO uint32 DINR28;
    __IO uint32 DINR29;
    __IO uint32 DINR30;
    __IO uint32 DINR31;
    __IO uint32 DOUTR0;
    __IO uint32 DOUTR1;
    __IO uint32 DOUTR2;
    __IO uint32 DOUTR3;
    __IO uint32 DOUTR4;
    __IO uint32 DOUTR5;
    __IO uint32 DOUTR6;
    __IO uint32 DOUTR7;
    __IO uint32 DOUTR8;
    __IO uint32 DOUTR9;
    __IO uint32 DOUTR10;
    __IO uint32 DOUTR11;
    __IO uint32 DOUTR12;
    __IO uint32 DOUTR13;
    __IO uint32 DOUTR14;
    __IO uint32 DOUTR15;
    __IO uint32 DOUTR16;
    __IO uint32 DOUTR17;
    __IO uint32 DOUTR18;
    __IO uint32 DOUTR19;
    __IO uint32 DOUTR20;
    __IO uint32 DOUTR21;
    __IO uint32 DOUTR22;
    __IO uint32 DOUTR23;
    __IO uint32 DOUTR24;
    __IO uint32 DOUTR25;
    __IO uint32 DOUTR26;
    __IO uint32 DOUTR27;
    __IO uint32 DOUTR28;
    __IO uint32 DOUTR29;
    __IO uint32 DOUTR30;
    __IO uint32 DOUTR31;
} MDIOS_TypeDef;

typedef struct
{
    __IO uint32 GOTGCTL;               /*!< USB_OTG Control and Status Register          000h */
    __IO uint32 GOTGINT;              /*!< USB_OTG Interrupt Register                   004h */
    __IO uint32 GAHBCFG;              /*!< Core AHB Configuration Register              008h */
    __IO uint32 GUSBCFG;              /*!< Core USB Configuration Register              00Ch */
    __IO uint32 GRSTCTL;              /*!< Core Reset Register                          010h */
    __IO uint32 GINTSTS;              /*!< Core Interrupt Register                      014h */
    __IO uint32 GINTMSK;              /*!< Core Interrupt Mask Register                 018h */
    __IO uint32 GRXSTSR;              /*!< Receive Sts Q Read Register                  01Ch */
    __IO uint32 GRXSTSP;              /*!< Receive Sts Q Read & POP Register            020h */
    __IO uint32 GRXFSIZ;              /*!< Receive FIFO Size Register                   024h */
    __IO uint32 DIEPTXF0_HNPTXFSIZ;   /*!< EP0 / Non Periodic Tx FIFO Size Register     028h */
    __IO uint32 HNPTXSTS;             /*!< Non Periodic Tx FIFO/Queue Sts reg           02Ch */
    uint32 Reserved30[2];             /*!< Reserved                                     030h */
    __IO uint32 GCCFG;                /*!< General Purpose IO Register                  038h */
    __IO uint32 CID;                  /*!< User ID Register                             03Ch */
    __IO uint32 GSNPSID;              /* USB_OTG core ID                                040h*/
    __IO uint32 GHWCFG1;              /* User HW config1                                044h*/
    __IO uint32 GHWCFG2;              /* User HW config2                                048h*/
    __IO uint32 GHWCFG3;              /*!< User HW config3                              04Ch */
    uint32  Reserved6;                /*!< Reserved                                     050h */
    __IO uint32 GLPMCFG;              /*!< LPM Register                                 054h */
    __IO uint32 GPWRDN;               /*!< Power Down Register                          058h */
    __IO uint32 GDFIFOCFG;            /*!< DFIFO Software Config Register               05Ch */
    __IO uint32 GADPCTL;             /*!< ADP Timer, Control and Status Register       60Ch */
        uint32  Reserved43[39];         /*!< Reserved                                058h-0FFh */
    __IO uint32 HPTXFSIZ;             /*!< Host Periodic Tx FIFO Size Reg               100h */
    __IO uint32 DIEPTXF[0x0F];        /*!< dev Periodic Transmit FIFO */
} USB_OTG_GlobalTypeDef;

typedef struct
{
    __IO uint32 DCFG;            /*!< dev Configuration Register   800h */
    __IO uint32 DCTL;            /*!< dev Control Register         804h */
    __IO uint32 DSTS;            /*!< dev Status Register (RO)     808h */
    uint32 Reserved0C;           /*!< Reserved                     80Ch */
    __IO uint32 DIEPMSK;         /*!< dev IN Endpoint Mask         810h */
    __IO uint32 DOEPMSK;         /*!< dev OUT Endpoint Mask        814h */
    __IO uint32 DAINT;           /*!< dev All Endpoints Itr Reg    818h */
    __IO uint32 DAINTMSK;        /*!< dev All Endpoints Itr Mask   81Ch */
    uint32  Reserved20;          /*!< Reserved                     820h */
    uint32 Reserved9;            /*!< Reserved                     824h */
    __IO uint32 DVBUSDIS;        /*!< dev VBUS discharge Register  828h */
    __IO uint32 DVBUSPULSE;      /*!< dev VBUS Pulse Register      82Ch */
    __IO uint32 DTHRCTL;         /*!< dev threshold                830h */
    __IO uint32 DIEPEMPMSK;      /*!< dev empty msk                834h */
    __IO uint32 DEACHINT;        /*!< dedicated EP interrupt       838h */
    __IO uint32 DEACHMSK;        /*!< dedicated EP msk             83Ch */
    uint32 Reserved40;           /*!< dedicated EP mask            840h */
    __IO uint32 DINEP1MSK;       /*!< dedicated EP mask            844h */
    uint32  Reserved44[15];      /*!< Reserved                 844-87Ch */
    __IO uint32 DOUTEP1MSK;      /*!< dedicated EP msk             884h */
} USB_OTG_DeviceTypeDef;

typedef struct
{
    __IO uint32 DIEPCTL;           /*!< dev IN Endpoint Control Reg    900h + (ep_num * 20h) + 00h */
    uint32 Reserved04;             /*!< Reserved                       900h + (ep_num * 20h) + 04h */
    __IO uint32 DIEPINT;           /*!< dev IN Endpoint Itr Reg        900h + (ep_num * 20h) + 08h */
    uint32 Reserved0C;             /*!< Reserved                       900h + (ep_num * 20h) + 0Ch */
    __IO uint32 DIEPTSIZ;          /*!< IN Endpoint Txfer Size         900h + (ep_num * 20h) + 10h */
    __IO uint32 DIEPDMA;           /*!< IN Endpoint DMA Address Reg    900h + (ep_num * 20h) + 14h */
    __IO uint32 DTXFSTS;           /*!< IN Endpoint Tx FIFO Status Reg 900h + (ep_num * 20h) + 18h */
    uint32 Reserved18;             /*!< Reserved  900h+(ep_num*20h)+1Ch-900h+ (ep_num * 20h) + 1Ch */
} USB_OTG_INEndpointTypeDef;

typedef struct
{
    __IO uint32 DOEPCTL;       /*!< dev OUT Endpoint Control Reg           B00h + (ep_num * 20h) + 00h */
    uint32 Reserved04;         /*!< Reserved                               B00h + (ep_num * 20h) + 04h */
    __IO uint32 DOEPINT;       /*!< dev OUT Endpoint Itr Reg               B00h + (ep_num * 20h) + 08h */
    uint32 Reserved0C;         /*!< Reserved                               B00h + (ep_num * 20h) + 0Ch */
    __IO uint32 DOEPTSIZ;      /*!< dev OUT Endpoint Txfer Size            B00h + (ep_num * 20h) + 10h */
    __IO uint32 DOEPDMA;       /*!< dev OUT Endpoint DMA Address           B00h + (ep_num * 20h) + 14h */
    uint32 Reserved18[2];      /*!< Reserved B00h + (ep_num * 20h) + 18h - B00h + (ep_num * 20h) + 1Ch */
} USB_OTG_OUTEndpointTypeDef;

typedef struct
{
    __IO uint32 HCFG;             /*!< Host Configuration Register          400h */
    __IO uint32 HFIR;             /*!< Host Frame Interval Register         404h */
    __IO uint32 HFNUM;            /*!< Host Frame Nbr/Frame Remaining       408h */
    uint32 Reserved40C;           /*!< Reserved                             40Ch */
    __IO uint32 HPTXSTS;          /*!< Host Periodic Tx FIFO/ Queue Status  410h */
    __IO uint32 HAINT;            /*!< Host All Channels Interrupt Register 414h */
    __IO uint32 HAINTMSK;         /*!< Host All Channels Interrupt Mask     418h */
} USB_OTG_HostTypeDef;

typedef struct
{
    __IO uint32 HCCHAR;           /*!< Host Channel Characteristics Register    500h */
    __IO uint32 HCSPLT;           /*!< Host Channel Split Control Register      504h */
    __IO uint32 HCINT;            /*!< Host Channel Interrupt Register          508h */
    __IO uint32 HCINTMSK;         /*!< Host Channel Interrupt Mask Register     50Ch */
    __IO uint32 HCTSIZ;           /*!< Host Channel Transfer Size Register      510h */
    __IO uint32 HCDMA;            /*!< Host Channel DMA Address Register        514h */
    uint32 Reserved[2];           /*!< Reserved                                      */
} USB_OTG_HostChannelTypeDef;

