NETNABI-PJ/PBOT/PJ_DCB/DCB_STM32H723ZG/Code/Core/stm32h723xx_reg.h
#define SYSCFG_PMCR_EPIS_SEL_Pos        (21U)
#define SYSCFG_PMCR_EPIS_SEL_Msk        (0x7UL << SYSCFG_PMCR_EPIS_SEL_Pos)    /*!< 0x00E00000 */
#define SYSCFG_PMCR_EPIS_SEL            SYSCFG_PMCR_EPIS_SEL_Msk               /*!< Ethernet PHY Interface Selection */
#define SYSCFG_PMCR_EPIS_SEL_0          (0x1UL << SYSCFG_PMCR_EPIS_SEL_Pos)    /*!< 0x00200000 */
#define SYSCFG_PMCR_EPIS_SEL_1          (0x2UL << SYSCFG_PMCR_EPIS_SEL_Pos)    /*!< 0x00400000 */
#define SYSCFG_PMCR_EPIS_SEL_2          (0x4UL << SYSCFG_PMCR_EPIS_SEL_Pos)    /*!< 0x00800000 */
#define SYSCFG_PMCR_PA0SO_Pos           (24U)
#define SYSCFG_PMCR_PA0SO_Msk           (0x1UL << SYSCFG_PMCR_PA0SO_Pos)       /*!< 0x01000000 */
#define SYSCFG_PMCR_PA0SO               SYSCFG_PMCR_PA0SO_Msk                  /*!< PA0 Switch Open */
#define SYSCFG_PMCR_PA1SO_Pos           (25U)
#define SYSCFG_PMCR_PA1SO_Msk           (0x1UL << SYSCFG_PMCR_PA1SO_Pos)       /*!< 0x02000000 */
#define SYSCFG_PMCR_PA1SO               SYSCFG_PMCR_PA1SO_Msk                  /*!< PA1 Switch Open */
#define SYSCFG_PMCR_PC2SO_Pos           (26U)
#define SYSCFG_PMCR_PC2SO_Msk           (0x1UL << SYSCFG_PMCR_PC2SO_Pos)       /*!< 0x04000000 */
#define SYSCFG_PMCR_PC2SO               SYSCFG_PMCR_PC2SO_Msk                  /*!< PC2 Switch Open */
#define SYSCFG_PMCR_PC3SO_Pos           (27U)
#define SYSCFG_PMCR_PC3SO_Msk           (0x1UL << SYSCFG_PMCR_PC3SO_Pos)       /*!< 0x08000000 */
#define SYSCFG_PMCR_PC3SO               SYSCFG_PMCR_PC3SO_Msk                  /*!< PC3 Switch Open */

/*****************  Bit definition for SYSCFG_EXTICR1 register  ***************/
#define SYSCFG_EXTICR1_EXTI0_Pos        (0U)
#define SYSCFG_EXTICR1_EXTI0_Msk        (0xFUL << SYSCFG_EXTICR1_EXTI0_Pos)    /*!< 0x0000000F */
#define SYSCFG_EXTICR1_EXTI0            SYSCFG_EXTICR1_EXTI0_Msk               /*!<EXTI 0 configuration */
#define SYSCFG_EXTICR1_EXTI1_Pos        (4U)
#define SYSCFG_EXTICR1_EXTI1_Msk        (0xFUL << SYSCFG_EXTICR1_EXTI1_Pos)    /*!< 0x000000F0 */
#define SYSCFG_EXTICR1_EXTI1            SYSCFG_EXTICR1_EXTI1_Msk               /*!<EXTI 1 configuration */
#define SYSCFG_EXTICR1_EXTI2_Pos        (8U)
#define SYSCFG_EXTICR1_EXTI2_Msk        (0xFUL << SYSCFG_EXTICR1_EXTI2_Pos)    /*!< 0x00000F00 */
#define SYSCFG_EXTICR1_EXTI2            SYSCFG_EXTICR1_EXTI2_Msk               /*!<EXTI 2 configuration */
#define SYSCFG_EXTICR1_EXTI3_Pos        (12U)
#define SYSCFG_EXTICR1_EXTI3_Msk        (0xFUL << SYSCFG_EXTICR1_EXTI3_Pos)    /*!< 0x0000F000 */
#define SYSCFG_EXTICR1_EXTI3            SYSCFG_EXTICR1_EXTI3_Msk               /*!<EXTI 3 configuration */
/**
  * @brief   EXTI0 configuration
  */
#define SYSCFG_EXTICR1_EXTI0_PA         ((uint32)0x00000000)                 /*!<PA[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PB         ((uint32)0x00000001)                 /*!<PB[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PC         ((uint32)0x00000002)                 /*!<PC[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PD         ((uint32)0x00000003)                 /*!<PD[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PE         ((uint32)0x00000004)                 /*!<PE[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PF         ((uint32)0x00000005)                 /*!<PF[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PG         ((uint32)0x00000006)                 /*!<PG[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PH         ((uint32)0x00000007)                 /*!<PH[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PJ         ((uint32)0x00000009)                 /*!<PJ[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PK         ((uint32)0x0000000A)                 /*!<PK[0] pin */

/**
  * @brief   EXTI1 configuration
  */
#define SYSCFG_EXTICR1_EXTI1_PA         ((uint32)0x00000000)                 /*!<PA[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PB         ((uint32)0x00000010)                 /*!<PB[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PC         ((uint32)0x00000020)                 /*!<PC[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PD         ((uint32)0x00000030)                 /*!<PD[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PE         ((uint32)0x00000040)                 /*!<PE[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PF         ((uint32)0x00000050)                 /*!<PF[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PG         ((uint32)0x00000060)                 /*!<PG[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PH         ((uint32)0x00000070)                 /*!<PH[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PJ         ((uint32)0x00000090)                 /*!<PJ[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PK         ((uint32)0x000000A0)                 /*!<PK[1] pin */
/**
  * @brief   EXTI2 configuration
  */
#define SYSCFG_EXTICR1_EXTI2_PA         ((uint32)0x00000000)                 /*!<PA[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PB         ((uint32)0x00000100)                 /*!<PB[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PC         ((uint32)0x00000200)                 /*!<PC[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PD         ((uint32)0x00000300)                 /*!<PD[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PE         ((uint32)0x00000400)                 /*!<PE[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PF         ((uint32)0x00000500)                 /*!<PF[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PG         ((uint32)0x00000600)                 /*!<PG[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PH         ((uint32)0x00000700)                 /*!<PH[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PJ         ((uint32)0x00000900)                 /*!<PJ[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PK         ((uint32)0x00000A00)                 /*!<PK[2] pin */

/**
  * @brief   EXTI3 configuration
  */
#define SYSCFG_EXTICR1_EXTI3_PA         ((uint32)0x00000000)                 /*!<PA[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PB         ((uint32)0x00001000)                 /*!<PB[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PC         ((uint32)0x00002000)                 /*!<PC[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PD         ((uint32)0x00003000)                 /*!<PD[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PE         ((uint32)0x00004000)                 /*!<PE[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PF         ((uint32)0x00005000)                 /*!<PF[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PG         ((uint32)0x00006000)                 /*!<PG[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PH         ((uint32)0x00007000)                 /*!<PH[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PJ         ((uint32)0x00009000)                 /*!<PJ[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PK         ((uint32)0x0000A000)                 /*!<PK[3] pin */

