NETNABI-PJ/PBOT/PJ_DCB/DCB_STM32H723ZG/Code/Core/stm32h723xx_reg.h
/*******************************************************************************
 *                 Register Abstraction
  Core Register contain:
  - Core Register
  - Core NVIC Register
  - Core SCB Register
  - Core SysTick Register
  - Core Debug Register
  - Core MPU Register
  - Core FPU Register
 ******************************************************************************/
typedef union
{
    struct
    {
        uint32 _reserved0:16;              /*!< bit:  0..15  Reserved */
        uint32 GE:4;                       /*!< bit: 16..19  Greater than or Equal flags */
        uint32 _reserved1:7;               /*!< bit: 20..26  Reserved */
        uint32 Q:1;                        /*!< bit:     27  Saturation condition flag */
        uint32 V:1;                        /*!< bit:     28  Overflow condition code flag */
        uint32 C:1;                        /*!< bit:     29  Carry condition code flag */
        uint32 Z:1;                        /*!< bit:     30  Zero condition code flag */
        uint32 N:1;                        /*!< bit:     31  Negative condition code flag */
    } b;                                   /*!< Structure used for bit  access */
    uint32 w;                            /*!< Type      used for word access */
} APSR_Type;

/* APSR Register Definitions */
#define APSR_N_Pos                         31U                                            /*!< APSR: N Position */
#define APSR_N_Msk                         (1UL << APSR_N_Pos)                            /*!< APSR: N Mask */

#define APSR_Z_Pos                         30U                                            /*!< APSR: Z Position */
#define APSR_Z_Msk                         (1UL << APSR_Z_Pos)                            /*!< APSR: Z Mask */

#define APSR_C_Pos                         29U                                            /*!< APSR: C Position */
#define APSR_C_Msk                         (1UL << APSR_C_Pos)                            /*!< APSR: C Mask */

#define APSR_V_Pos                         28U                                            /*!< APSR: V Position */
#define APSR_V_Msk                         (1UL << APSR_V_Pos)                            /*!< APSR: V Mask */

#define APSR_Q_Pos                         27U                                            /*!< APSR: Q Position */
#define APSR_Q_Msk                         (1UL << APSR_Q_Pos)                            /*!< APSR: Q Mask */

#define APSR_GE_Pos                        16U                                            /*!< APSR: GE Position */
#define APSR_GE_Msk                        (0xFUL << APSR_GE_Pos)                         /*!< APSR: GE Mask */

typedef union
{
    struct
    {
        uint32 ISR:9;                      /*!< bit:  0.. 8  Exception number */
        uint32 _reserved0:23;              /*!< bit:  9..31  Reserved */
    } b;                                   /*!< Structure used for bit  access */
    uint32 w;                            /*!< Type      used for word access */
} IPSR_Type;

/* IPSR Register Definitions */
#define IPSR_ISR_Pos                        0U                                            /*!< IPSR: ISR Position */
#define IPSR_ISR_Msk                       (0x1FFUL /*<< IPSR_ISR_Pos*/)                  /*!< IPSR: ISR Mask */

typedef union
{
    struct
    {
        uint32 ISR:9;                      /*!< bit:  0.. 8  Exception number */
        uint32 _reserved0:1;               /*!< bit:      9  Reserved */
        uint32 ICI_IT_1:6;                 /*!< bit: 10..15  ICI/IT part 1 */
        uint32 GE:4;                       /*!< bit: 16..19  Greater than or Equal flags */
        uint32 _reserved1:4;               /*!< bit: 20..23  Reserved */
        uint32 T:1;                        /*!< bit:     24  Thumb bit */
        uint32 ICI_IT_2:2;                 /*!< bit: 25..26  ICI/IT part 2 */
        uint32 Q:1;                        /*!< bit:     27  Saturation condition flag */
        uint32 V:1;                        /*!< bit:     28  Overflow condition code flag */
        uint32 C:1;                        /*!< bit:     29  Carry condition code flag */
        uint32 Z:1;                        /*!< bit:     30  Zero condition code flag */
        uint32 N:1;                        /*!< bit:     31  Negative condition code flag */
    } b;                                   /*!< Structure used for bit  access */
    uint32 w;                            /*!< Type      used for word access */
} xPSR_Type;

/* xPSR Register Definitions */
#define xPSR_N_Pos                         31U                                            /*!< xPSR: N Position */
#define xPSR_N_Msk                         (1UL << xPSR_N_Pos)                            /*!< xPSR: N Mask */

#define xPSR_Z_Pos                         30U                                            /*!< xPSR: Z Position */
#define xPSR_Z_Msk                         (1UL << xPSR_Z_Pos)                            /*!< xPSR: Z Mask */

#define xPSR_C_Pos                         29U                                            /*!< xPSR: C Position */
#define xPSR_C_Msk                         (1UL << xPSR_C_Pos)                            /*!< xPSR: C Mask */

#define xPSR_V_Pos                         28U                                            /*!< xPSR: V Position */
#define xPSR_V_Msk                         (1UL << xPSR_V_Pos)                            /*!< xPSR: V Mask */

#define xPSR_Q_Pos                         27U                                            /*!< xPSR: Q Position */
#define xPSR_Q_Msk                         (1UL << xPSR_Q_Pos)                            /*!< xPSR: Q Mask */

#define xPSR_ICI_IT_2_Pos                  25U                                            /*!< xPSR: ICI/IT part 2 Position */
#define xPSR_ICI_IT_2_Msk                  (3UL << xPSR_ICI_IT_2_Pos)                     /*!< xPSR: ICI/IT part 2 Mask */

#define xPSR_T_Pos                         24U                                            /*!< xPSR: T Position */
#define xPSR_T_Msk                         (1UL << xPSR_T_Pos)                            /*!< xPSR: T Mask */

#define xPSR_GE_Pos                        16U                                            /*!< xPSR: GE Position */
#define xPSR_GE_Msk                        (0xFUL << xPSR_GE_Pos)                         /*!< xPSR: GE Mask */

