NETNABI-PJ/PBOT/PJ_DCB/DCB_STM32H723ZG/Code/Core/stm32h723xx_reg.h
#define xPSR_ICI_IT_1_Pos                  10U                                            /*!< xPSR: ICI/IT part 1 Position */
#define xPSR_ICI_IT_1_Msk                  (0x3FUL << xPSR_ICI_IT_1_Pos)                  /*!< xPSR: ICI/IT part 1 Mask */

#define xPSR_ISR_Pos                        0U                                            /*!< xPSR: ISR Position */
#define xPSR_ISR_Msk                       (0x1FFUL /*<< xPSR_ISR_Pos*/)                  /*!< xPSR: ISR Mask */

typedef union
{
    struct
    {
        uint32 nPRIV:1;                    /*!< bit:      0  Execution privilege in Thread mode */
        uint32 SPSEL:1;                    /*!< bit:      1  Stack to be used */
        uint32 FPCA:1;                     /*!< bit:      2  FP extension active flag */
        uint32 _reserved0:29;              /*!< bit:  3..31  Reserved */
    } b;                                   /*!< Structure used for bit  access */
    uint32 w;                            /*!< Type      used for word access */
} CONTROL_Type;

/* CONTROL Register Definitions */
#define CONTROL_FPCA_Pos                    2U                                            /*!< CONTROL: FPCA Position */
#define CONTROL_FPCA_Msk                   (1UL << CONTROL_FPCA_Pos)                      /*!< CONTROL: FPCA Mask */

#define CONTROL_SPSEL_Pos                   1U                                            /*!< CONTROL: SPSEL Position */
#define CONTROL_SPSEL_Msk                  (1UL << CONTROL_SPSEL_Pos)                     /*!< CONTROL: SPSEL Mask */

#define CONTROL_nPRIV_Pos                   0U                                            /*!< CONTROL: nPRIV Position */
#define CONTROL_nPRIV_Msk                  (1UL /*<< CONTROL_nPRIV_Pos*/)                 /*!< CONTROL: nPRIV Mask */

typedef struct
{
    __IOM uint32 ISER[8U];               /*!< Offset: 0x000 (R/W)  Interrupt Set Enable Register */
    uint32 RESERVED0[24U];
    __IOM uint32 ICER[8U];               /*!< Offset: 0x080 (R/W)  Interrupt Clear Enable Register */
    uint32 RESERVED1[24U];
    __IOM uint32 ISPR[8U];               /*!< Offset: 0x100 (R/W)  Interrupt Set Pending Register */
    uint32 RESERVED2[24U];
    __IOM uint32 ICPR[8U];               /*!< Offset: 0x180 (R/W)  Interrupt Clear Pending Register */
    uint32 RESERVED3[24U];
    __IOM uint32 IABR[8U];               /*!< Offset: 0x200 (R/W)  Interrupt Active bit Register */
    uint32 RESERVED4[56U];
    __IOM uint8  IP[240U];               /*!< Offset: 0x300 (R/W)  Interrupt Priority Register (8Bit wide) */
    uint32 RESERVED5[644U];
    __OM  uint32 STIR;                   /*!< Offset: 0xE00 ( /W)  Software Trigger Interrupt Register */
}  NVIC_Type;

/* Software Triggered Interrupt Register Definitions */
#define NVIC_STIR_INTID_Pos                 0U                                         /*!< STIR: INTLINESNUM Position */
#define NVIC_STIR_INTID_Msk                (0x1FFUL /*<< NVIC_STIR_INTID_Pos*/)        /*!< STIR: INTLINESNUM Mask */


typedef struct
{
    __IM  uint32 CPUID;                  /*!< Offset: 0x000 (R/ )  CPUID Base Register */
    __IOM uint32 ICSR;                   /*!< Offset: 0x004 (R/W)  Interrupt Control and State Register */
    __IOM uint32 VTOR;                   /*!< Offset: 0x008 (R/W)  Vector Table Offset Register */
    __IOM uint32 AIRCR;                  /*!< Offset: 0x00C (R/W)  Application Interrupt and Reset Control Register */
    __IOM uint32 SCR;                    /*!< Offset: 0x010 (R/W)  System Control Register */
    __IOM uint32 CCR;                    /*!< Offset: 0x014 (R/W)  Configuration Control Register */
    __IOM uint8  SHPR[12U];              /*!< Offset: 0x018 (R/W)  System Handlers Priority Registers (4-7, 8-11, 12-15) */
    __IOM uint32 SHCSR;                  /*!< Offset: 0x024 (R/W)  System Handler Control and State Register */
    __IOM uint32 CFSR;                   /*!< Offset: 0x028 (R/W)  Configurable Fault Status Register */
    __IOM uint32 HFSR;                   /*!< Offset: 0x02C (R/W)  HardFault Status Register */
    __IOM uint32 DFSR;                   /*!< Offset: 0x030 (R/W)  Debug Fault Status Register */
    __IOM uint32 MMFAR;                  /*!< Offset: 0x034 (R/W)  MemManage Fault Address Register */
    __IOM uint32 BFAR;                   /*!< Offset: 0x038 (R/W)  BusFault Address Register */
    __IOM uint32 AFSR;                   /*!< Offset: 0x03C (R/W)  Auxiliary Fault Status Register */
    __IM  uint32 ID_PFR[2U];             /*!< Offset: 0x040 (R/ )  Processor Feature Register */
    __IM  uint32 ID_DFR;                 /*!< Offset: 0x048 (R/ )  Debug Feature Register */
    __IM  uint32 ID_AFR;                 /*!< Offset: 0x04C (R/ )  Auxiliary Feature Register */
    __IM  uint32 ID_MFR[4U];             /*!< Offset: 0x050 (R/ )  Memory Model Feature Register */
    __IM  uint32 ID_ISAR[5U];            /*!< Offset: 0x060 (R/ )  Instruction Set Attributes Register */
    uint32 RESERVED0[1U];
    __IM  uint32 CLIDR;                  /*!< Offset: 0x078 (R/ )  Cache Level ID register */
    __IM  uint32 CTR;                    /*!< Offset: 0x07C (R/ )  Cache Type register */
    __IM  uint32 CCSIDR;                 /*!< Offset: 0x080 (R/ )  Cache Size ID Register */
    __IOM uint32 CSSELR;                 /*!< Offset: 0x084 (R/W)  Cache Size Selection Register */
    __IOM uint32 CPACR;                  /*!< Offset: 0x088 (R/W)  Coprocessor Access Control Register */
    uint32 RESERVED3[93U];
    __OM  uint32 STIR;                   /*!< Offset: 0x200 ( /W)  Software Triggered Interrupt Register */
    uint32 RESERVED4[15U];
    __IM  uint32 MVFR0;                  /*!< Offset: 0x240 (R/ )  Media and VFP Feature Register 0 */
    __IM  uint32 MVFR1;                  /*!< Offset: 0x244 (R/ )  Media and VFP Feature Register 1 */
    __IM  uint32 MVFR2;                  /*!< Offset: 0x248 (R/ )  Media and VFP Feature Register 2 */
    uint32 RESERVED5[1U];
    __OM  uint32 ICIALLU;                /*!< Offset: 0x250 ( /W)  I-Cache Invalidate All to PoU */
    uint32 RESERVED6[1U];
    __OM  uint32 ICIMVAU;                /*!< Offset: 0x258 ( /W)  I-Cache Invalidate by MVA to PoU */
    __OM  uint32 DCIMVAC;                /*!< Offset: 0x25C ( /W)  D-Cache Invalidate by MVA to PoC */
    __OM  uint32 DCISW;                  /*!< Offset: 0x260 ( /W)  D-Cache Invalidate by Set-way */
    __OM  uint32 DCCMVAU;                /*!< Offset: 0x264 ( /W)  D-Cache Clean by MVA to PoU */
    __OM  uint32 DCCMVAC;                /*!< Offset: 0x268 ( /W)  D-Cache Clean by MVA to PoC */
    __OM  uint32 DCCSW;                  /*!< Offset: 0x26C ( /W)  D-Cache Clean by Set-way */
    __OM  uint32 DCCIMVAC;               /*!< Offset: 0x270 ( /W)  D-Cache Clean and Invalidate by MVA to PoC */
    __OM  uint32 DCCISW;                 /*!< Offset: 0x274 ( /W)  D-Cache Clean and Invalidate by Set-way */
    uint32 RESERVED7[6U];
    __IOM uint32 ITCMCR;                 /*!< Offset: 0x290 (R/W)  Instruction Tightly-Coupled Memory Control Register */
    __IOM uint32 DTCMCR;                 /*!< Offset: 0x294 (R/W)  Data Tightly-Coupled Memory Control Registers */
    __IOM uint32 AHBPCR;                 /*!< Offset: 0x298 (R/W)  AHBP Control Register */
    __IOM uint32 CACR;                   /*!< Offset: 0x29C (R/W)  L1 Cache Control Register */
    __IOM uint32 AHBSCR;                 /*!< Offset: 0x2A0 (R/W)  AHB Slave Control Register */
    uint32 RESERVED8[1U];
    __IOM uint32 ABFSR;                  /*!< Offset: 0x2A8 (R/W)  Auxiliary Bus Fault Status Register */
} SCB_Type;

/* SCB CPUID Register Definitions */
#define SCB_CPUID_IMPLEMENTER_Pos          24U                                            /*!< SCB CPUID: IMPLEMENTER Position */
#define SCB_CPUID_IMPLEMENTER_Msk          (0xFFUL << SCB_CPUID_IMPLEMENTER_Pos)          /*!< SCB CPUID: IMPLEMENTER Mask */

#define SCB_CPUID_VARIANT_Pos              20U                                            /*!< SCB CPUID: VARIANT Position */
#define SCB_CPUID_VARIANT_Msk              (0xFUL << SCB_CPUID_VARIANT_Pos)               /*!< SCB CPUID: VARIANT Mask */

