NETNABI-PJ/PBOT/PJ_DCB/DCB_STM32H723ZG/Code/Core/stm32h723xx_reg.h
/* ITM Trace Control Register Definitions */
#define ITM_TCR_BUSY_Pos                   23U                                            /*!< ITM TCR: BUSY Position */
#define ITM_TCR_BUSY_Msk                   (1UL << ITM_TCR_BUSY_Pos)                      /*!< ITM TCR: BUSY Mask */

#define ITM_TCR_TraceBusID_Pos             16U                                            /*!< ITM TCR: ATBID Position */
#define ITM_TCR_TraceBusID_Msk             (0x7FUL << ITM_TCR_TraceBusID_Pos)             /*!< ITM TCR: ATBID Mask */

#define ITM_TCR_GTSFREQ_Pos                10U                                            /*!< ITM TCR: Global timestamp frequency Position */
#define ITM_TCR_GTSFREQ_Msk                (3UL << ITM_TCR_GTSFREQ_Pos)                   /*!< ITM TCR: Global timestamp frequency Mask */

#define ITM_TCR_TSPrescale_Pos              8U                                            /*!< ITM TCR: TSPrescale Position */
#define ITM_TCR_TSPrescale_Msk             (3UL << ITM_TCR_TSPrescale_Pos)                /*!< ITM TCR: TSPrescale Mask */

#define ITM_TCR_SWOENA_Pos                  4U                                            /*!< ITM TCR: SWOENA Position */
#define ITM_TCR_SWOENA_Msk                 (1UL << ITM_TCR_SWOENA_Pos)                    /*!< ITM TCR: SWOENA Mask */

#define ITM_TCR_DWTENA_Pos                  3U                                            /*!< ITM TCR: DWTENA Position */
#define ITM_TCR_DWTENA_Msk                 (1UL << ITM_TCR_DWTENA_Pos)                    /*!< ITM TCR: DWTENA Mask */

#define ITM_TCR_SYNCENA_Pos                 2U                                            /*!< ITM TCR: SYNCENA Position */
#define ITM_TCR_SYNCENA_Msk                (1UL << ITM_TCR_SYNCENA_Pos)                   /*!< ITM TCR: SYNCENA Mask */

#define ITM_TCR_TSENA_Pos                   1U                                            /*!< ITM TCR: TSENA Position */
#define ITM_TCR_TSENA_Msk                  (1UL << ITM_TCR_TSENA_Pos)                     /*!< ITM TCR: TSENA Mask */

#define ITM_TCR_ITMENA_Pos                  0U                                            /*!< ITM TCR: ITM Enable bit Position */
#define ITM_TCR_ITMENA_Msk                 (1UL /*<< ITM_TCR_ITMENA_Pos*/)                /*!< ITM TCR: ITM Enable bit Mask */

/* ITM Lock Status Register Definitions */
#define ITM_LSR_ByteAcc_Pos                 2U                                            /*!< ITM LSR: ByteAcc Position */
#define ITM_LSR_ByteAcc_Msk                (1UL << ITM_LSR_ByteAcc_Pos)                   /*!< ITM LSR: ByteAcc Mask */

#define ITM_LSR_Access_Pos                  1U                                            /*!< ITM LSR: Access Position */
#define ITM_LSR_Access_Msk                 (1UL << ITM_LSR_Access_Pos)                    /*!< ITM LSR: Access Mask */

#define ITM_LSR_Present_Pos                 0U                                            /*!< ITM LSR: Present Position */
#define ITM_LSR_Present_Msk                (1UL /*<< ITM_LSR_Present_Pos*/)               /*!< ITM LSR: Present Mask */

typedef struct
{
    __IOM uint32 CTRL;                   /*!< Offset: 0x000 (R/W)  Control Register */
    __IOM uint32 CYCCNT;                 /*!< Offset: 0x004 (R/W)  Cycle Count Register */
    __IOM uint32 CPICNT;                 /*!< Offset: 0x008 (R/W)  CPI Count Register */
    __IOM uint32 EXCCNT;                 /*!< Offset: 0x00C (R/W)  Exception Overhead Count Register */
    __IOM uint32 SLEEPCNT;               /*!< Offset: 0x010 (R/W)  Sleep Count Register */
    __IOM uint32 LSUCNT;                 /*!< Offset: 0x014 (R/W)  LSU Count Register */
    __IOM uint32 FOLDCNT;                /*!< Offset: 0x018 (R/W)  Folded-instruction Count Register */
    __IM  uint32 PCSR;                   /*!< Offset: 0x01C (R/ )  Program Counter Sample Register */
    __IOM uint32 COMP0;                  /*!< Offset: 0x020 (R/W)  Comparator Register 0 */
    __IOM uint32 MASK0;                  /*!< Offset: 0x024 (R/W)  Mask Register 0 */
    __IOM uint32 FUNCTION0;              /*!< Offset: 0x028 (R/W)  Function Register 0 */
    uint32 RESERVED0[1U];
    __IOM uint32 DWT_COMP1;                  /*!< Offset: 0x030 (R/W)  Comparator Register 1 */
    __IOM uint32 MASK1;                  /*!< Offset: 0x034 (R/W)  Mask Register 1 */
    __IOM uint32 FUNCTION1;              /*!< Offset: 0x038 (R/W)  Function Register 1 */
    uint32 RESERVED1[1U];
    __IOM uint32 DWT_COMP2;                  /*!< Offset: 0x040 (R/W)  Comparator Register 2 */
    __IOM uint32 MASK2;                  /*!< Offset: 0x044 (R/W)  Mask Register 2 */
    __IOM uint32 FUNCTION2;              /*!< Offset: 0x048 (R/W)  Function Register 2 */
    uint32 RESERVED2[1U];
    __IOM uint32 COMP3;                  /*!< Offset: 0x050 (R/W)  Comparator Register 3 */
    __IOM uint32 MASK3;                  /*!< Offset: 0x054 (R/W)  Mask Register 3 */
    __IOM uint32 FUNCTION3;              /*!< Offset: 0x058 (R/W)  Function Register 3 */
    uint32 RESERVED3[981U];
    __OM  uint32 LAR;                    /*!< Offset: 0xFB0 (  W)  Lock Access Register */
    __IM  uint32 LSR;                    /*!< Offset: 0xFB4 (R  )  Lock Status Register */
} DWT_Type;

/* DWT Control Register Definitions */
#define DWT_CTRL_NUMCOMP_Pos               28U                                         /*!< DWT CTRL: NUMCOMP Position */
#define DWT_CTRL_NUMCOMP_Msk               (0xFUL << DWT_CTRL_NUMCOMP_Pos)             /*!< DWT CTRL: NUMCOMP Mask */

#define DWT_CTRL_NOTRCPKT_Pos              27U                                         /*!< DWT CTRL: NOTRCPKT Position */
#define DWT_CTRL_NOTRCPKT_Msk              (0x1UL << DWT_CTRL_NOTRCPKT_Pos)            /*!< DWT CTRL: NOTRCPKT Mask */

#define DWT_CTRL_NOEXTTRIG_Pos             26U                                         /*!< DWT CTRL: NOEXTTRIG Position */
#define DWT_CTRL_NOEXTTRIG_Msk             (0x1UL << DWT_CTRL_NOEXTTRIG_Pos)           /*!< DWT CTRL: NOEXTTRIG Mask */

#define DWT_CTRL_NOCYCCNT_Pos              25U                                         /*!< DWT CTRL: NOCYCCNT Position */
#define DWT_CTRL_NOCYCCNT_Msk              (0x1UL << DWT_CTRL_NOCYCCNT_Pos)            /*!< DWT CTRL: NOCYCCNT Mask */

